----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/scripts/log
> s/2022.11.07-09.50.48.log.txt
  log type:  text
 opened on:   7 Nov 2022, 09:50:48

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  7 Nov 2022 09:50:48

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 30 Mar 2021

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    4

. di "OS:            `c(os)' `c(osdtl)'"
OS:            MacOSX 12.4.0

. di "Machine type:  `c(machine_type)'"
Machine type:  Mac (Apple Silicon)

. 
. * Stata version control
. version 16

. 
. * Create directories for output files
. cap mkdir "$Persuasion/results"

. 
. **********************
. * Run analysis
. **********************
. * TABLE 1. Persuasion Rates: Papers on Voter Turnout
. *do "$Persuasion/scripts/table1.do"
. 
. * Effects of Uncensored Media: Revisiting Chen and Yang (2019)
. *   To generate the dataset "ChenYang2019.dta", it is necessary to run CY19_data
> .do 
. *   after downloading the original dataset from 
. *   the AER webpage at https://www.aeaweb.org/articles?id=10.1257/aer.20171765
. *   and storing them at "$Persuasion/data/ChenYang2019".
. *   As the dataset is already created and stored at "$Persuasion/data/ChenYang20
> 19", 
. *   the do file is commented below.
. *do "$Persuasion/scripts/CY19_data.do"
. *   TABLE 2. Persuasion Rates of Exposure to Uncensored Internet
. *do "$Persuasion/scripts/table2.do"
. 
. * Effects of Political News: Revisting Gerber, Karlan, and Bergan (2009) 
. *   TABLE 3. Summary Statistics of the GKB Data
. *do "$Persuasion/scripts/table3.do"
. *   TABLE 4. Estimates of the Key Parameters
. *do "$Persuasion/scripts/table4.do"
. 
. *       TABLE H1. Persuasion Rates: NTV Effects Using a Binary Instrument
. do "$Persuasion/scripts/tableH1old.do"

. ************
. * SCRIPT:   tableH1.do
. * PURPOSE:  Creates Table H1
. *
. * ACKNOWLEDGMENT
. *       The orginal dataset "NTV_Individual_Data.dta" is from Enikolopov, Petrov
> a, and Zhuravskaya (AER, 2011).
. ************
. 
. use "$Persuasion/data/EnikolopovPetrovaZhuravskaya2011/NTV_Individual_Data.dta",
>  clear

. 
. local basic = "logpop98 wage98_ln"

. local sociodem = "male age educ1 married consump"

. 
. local party_list = "Unity OVR"

. 
. ************* create outcome variables based on directional treatment **********
> ***
. 
. gen y_vote_Unity = 0

. replace y_vote_Unity = 1 if vote_Unity == 0   
(993 real changes made)

. 
. gen y_vote_OVR = 0

. replace y_vote_OVR = 1 if vote_OVR == 1   
(166 real changes made)

. 
. ************* create binary instruments *************
. 
. svyset [pweight=kishweig]

      pweight: kishweig
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. _pctile tvmaxtveloss5050powerA [pweight=kishweig], p(50)         

. scalar IV_p50 = r(r1)    

. 
. local IV_list = "p50"

. 
. foreach instv in  `IV_list'    {
  2. 
.         gen IV_NTV_`instv' = 0
  3. replace IV_NTV_`instv' = 1 if tvmaxtveloss5050powerA > IV_`instv'
  4. 
. ************* predict Z *************
. 
. probit  IV_NTV_`instv' `sociodem' `basic' [pweight=kishweig]  
  5. predict phat_Z1_`instv'
  6. 
. ************* predict T given Z=1 and Z=0 *************
. 
. probit  Watches_NTV_1999 `sociodem' `basic' [pweight=kishweig] if IV_NTV_`instv'
> ==1 
  7. predict phat_T_Z1_`instv'
  8. 
. probit  Watches_NTV_1999 `sociodem' `basic' [pweight=kishweig] if IV_NTV_`instv'
> ==0 
  9. predict phat_T_Z0_`instv'
 10. 
. ************* predict Y given Z=1 and Z=0 *************
. 
. foreach party in  `party_list'    {
 11. 
. gen newvote_`party'_`instv' = 0
 12. replace newvote_`party'_`instv' = 1 if y_vote_`party' == 1  
 13. 
. probit newvote_`party'_`instv' `sociodem' `basic' [pweight=kishweig] if IV_NTV_`
> instv'==1 
 14. predict phat_Y_Z1_`party'_`instv'
 15. 
. probit newvote_`party'_`instv' `sociodem' `basic' [pweight=kishweig] if IV_NTV_`
> instv'==0 
 16. predict phat_Y_Z0_`party'_`instv'
 17. 
. 
. gen     ate_`party'_`instv' = (phat_Y_Z1_`party'_`instv' - phat_Y_Z0_`party'_`in
> stv')/(1-phat_Y_Z0_`party'_`instv')
 18. gen      w1_`party'_`instv' = IV_NTV_`instv'/phat_Z1_`instv'
 19. gen      w0_`party'_`instv' = (1-IV_NTV_`instv')/(1-phat_Z1_`instv')
 20. gen      t1_`party'_`instv' = (newvote_`party'_`instv'-phat_Y_Z1_`party'_`ins
> tv')/(1-phat_Y_Z0_`party'_`instv') 
 21. gen      t0_`party'_`instv' = ((newvote_`party'_`instv'-phat_Y_Z0_`party'_`in
> stv')*(ate_`party'_`instv'-1))/(1-phat_Y_Z0_`party'_`instv') 
 22. gen    infl_`party'_`instv' = w1_`party'_`instv'*t1_`party'_`instv'+w0_`party
> '_`instv'*t0_`party'_`instv'
 23. gen new_ate_`party'_`instv' = infl_`party'_`instv' + ate_`party'_`instv'
 24. }
 25. 
. ************* average out with respect to covariates *************
. 
. svyset [pweight=kishweig]
 26. 
. foreach party in  `party_list'    {
 27. 
. matrix results_`party'_`instv' = J(3,2,0)
 28. 
.     svy: mean ate_`party'_`instv' 
 29.          matrix result = e(b)   
 30.          matrix results_`party'_`instv'[1,1] = result[1,1]
 31. 
.     svy: mean new_ate_`party'_`instv' 
 32.          matrix result = e(b)   
 33.                  matrix result_se = e(V)
 34.          matrix results_`party'_`instv'[1,2] = result[1,1]               
 35. 
.          matrix results_`party'_`instv'[2,1] = sqrt(result_se[1,1])             
>                  
 36.          matrix results_`party'_`instv'[2,2] = sqrt(result_se[1,1])
 37.                 
.          matrix results_`party'_`instv'[3,1] = results_`party'_`instv'[1,1]-1.64
> 5*sqrt(result_se[1,1])                           
 38.          matrix results_`party'_`instv'[3,2] = results_`party'_`instv'[1,2]-1
> .645*sqrt(result_se[1,1])
 39. 
. }
 40. 
. }
(1,714 real changes made)

Iteration 0:   log pseudolikelihood = -899.82225  
Iteration 1:   log pseudolikelihood = -637.03239  
Iteration 2:   log pseudolikelihood = -632.02486  
Iteration 3:   log pseudolikelihood = -632.02183  
Iteration 4:   log pseudolikelihood = -632.02183  

Probit regression                               Number of obs     =      1,300
                                                Wald chi2(7)      =     316.28
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -632.02183               Pseudo R2         =     0.2976

------------------------------------------------------------------------------
             |               Robust
  IV_NTV_p50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        male |   .0097789   .0932936     0.10   0.917    -.1730732    .1926311
         age |  -.0023185   .0030182    -0.77   0.442     -.008234    .0035969
       educ1 |  -.0639805   .1229572    -0.52   0.603    -.3049722    .1770112
     married |   .1163617   .0942448     1.23   0.217    -.0683546    .3010781
     consump |   .0805492   .0338647     2.38   0.017     .0141756    .1469229
    logpop98 |    .500765   .0386661    12.95   0.000     .4249809    .5765491
   wage98_ln |   .9332424   .1132222     8.24   0.000      .711331    1.155154
       _cons |  -9.232516   .7821602   -11.80   0.000    -10.76552    -7.69951
------------------------------------------------------------------------------
(option pr assumed; Pr(IV_NTV_p50))
(4,658 missing values generated)

Iteration 0:   log pseudolikelihood = -337.71586  
Iteration 1:   log pseudolikelihood = -303.04905  
Iteration 2:   log pseudolikelihood =  -302.8225  
Iteration 3:   log pseudolikelihood = -302.82247  

Probit regression                               Number of obs     =        531
                                                Wald chi2(7)      =      55.74
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -302.82247               Pseudo R2         =     0.1033

---------------------------------------------------------------------------------
                |               Robust
Watches_NT~1999 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           male |   .5283267   .1399676     3.77   0.000     .2539953    .8026581
            age |  -.0060683   .0045835    -1.32   0.186    -.0150517    .0029151
          educ1 |   .0299837   .1930064     0.16   0.877    -.3483018    .4082693
        married |  -.0339996   .1360404    -0.25   0.803    -.3006338    .2326346
        consump |   .1491447   .0496314     3.01   0.003     .0518689    .2464205
       logpop98 |  -.3464984   .0664112    -5.22   0.000    -.4766619   -.2163349
      wage98_ln |   .0833965   .2018935     0.41   0.680    -.3123075    .4791005
          _cons |   1.752134   1.569448     1.12   0.264    -1.323926    4.828195
---------------------------------------------------------------------------------
(option pr assumed; Pr(Watches_NTV_1999))
(4,658 missing values generated)

Iteration 0:   log pseudolikelihood = -456.99076  
Iteration 1:   log pseudolikelihood = -436.85115  
Iteration 2:   log pseudolikelihood = -436.80954  
Iteration 3:   log pseudolikelihood = -436.80954  

Probit regression                               Number of obs     =        654
                                                Wald chi2(7)      =      33.15
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -436.80954               Pseudo R2         =     0.0442

---------------------------------------------------------------------------------
                |               Robust
Watches_NT~1999 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           male |  -.0038638   .1173689    -0.03   0.974    -.2339026    .2261751
            age |  -.0058993   .0038063    -1.55   0.121    -.0133596    .0015609
          educ1 |   .3428302   .1532492     2.24   0.025     .0424672    .6431931
        married |   .1087181   .1213813     0.90   0.370    -.1291848     .346621
        consump |   .0142424   .0483248     0.29   0.768    -.0804724    .1089572
       logpop98 |  -.0529152   .0611979    -0.86   0.387    -.1728609    .0670306
      wage98_ln |   .6815044   .2065468     3.30   0.001     .2766801    1.086329
          _cons |  -4.308763   1.205377    -3.57   0.000    -6.671258   -1.946267
---------------------------------------------------------------------------------
(option pr assumed; Pr(Watches_NTV_1999))
(4,658 missing values generated)
(993 real changes made)

Iteration 0:   log pseudolikelihood = -394.34639  
Iteration 1:   log pseudolikelihood = -379.72819  
Iteration 2:   log pseudolikelihood = -379.69976  
Iteration 3:   log pseudolikelihood = -379.69976  

Probit regression                               Number of obs     =        566
                                                Wald chi2(7)      =      25.72
                                                Prob > chi2       =     0.0006
Log pseudolikelihood = -379.69976               Pseudo R2         =     0.0371

---------------------------------------------------------------------------------
                |               Robust
newvote_Unit~50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           male |   .0122972   .1233382     0.10   0.921    -.2294412    .2540355
            age |   .0153383   .0039424     3.89   0.000     .0076113    .0230653
          educ1 |   .5043756    .170662     2.96   0.003     .1698843    .8388668
        married |   .1531416   .1263446     1.21   0.225    -.0944894    .4007725
        consump |   .0419752   .0433286     0.97   0.333    -.0429473    .1268978
       logpop98 |  -.0489051   .0596189    -0.82   0.412     -.165756    .0679457
      wage98_ln |  -.1958184   .1728389    -1.13   0.257    -.5345764    .1429395
          _cons |   .8077722   1.344125     0.60   0.548    -1.826665    3.442209
---------------------------------------------------------------------------------
(option pr assumed; Pr(newvote_Unity_p50))
(4,658 missing values generated)

Iteration 0:   log pseudolikelihood = -508.83328  
Iteration 1:   log pseudolikelihood = -487.85992  
Iteration 2:   log pseudolikelihood = -487.83307  
Iteration 3:   log pseudolikelihood = -487.83307  

Probit regression                               Number of obs     =        734
                                                Wald chi2(7)      =      34.66
                                                Prob > chi2       =     0.0000
Log pseudolikelihood = -487.83307               Pseudo R2         =     0.0413

---------------------------------------------------------------------------------
                |               Robust
newvote_Unit~50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           male |   .0516846   .1109835     0.47   0.641     -.165839    .2692082
            age |   .0162951   .0035499     4.59   0.000     .0093375    .0232528
          educ1 |   .0519148   .1450576     0.36   0.720     -.232393    .3362225
        married |   .0589119    .113907     0.52   0.605    -.1643418    .2821656
        consump |  -.0034672   .0440552    -0.08   0.937    -.0898138    .0828794
       logpop98 |  -.1120165   .0576019    -1.94   0.052    -.2249142    .0008811
      wage98_ln |  -.0037709   .1864818    -0.02   0.984    -.3692686    .3617268
          _cons |   .0072407   1.080718     0.01   0.995    -2.110927    2.125408
---------------------------------------------------------------------------------
(option pr assumed; Pr(newvote_Unity_p50))
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(166 real changes made)

Iteration 0:   log pseudolikelihood = -161.37916  
Iteration 1:   log pseudolikelihood = -151.98292  
Iteration 2:   log pseudolikelihood = -151.71404  
Iteration 3:   log pseudolikelihood =  -151.7137  
Iteration 4:   log pseudolikelihood =  -151.7137  

Probit regression                               Number of obs     =        566
                                                Wald chi2(7)      =      15.98
                                                Prob > chi2       =     0.0253
Log pseudolikelihood =  -151.7137               Pseudo R2         =     0.0599

---------------------------------------------------------------------------------
                |               Robust
newvote_OVR_p50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           male |   -.418225   .1876347    -2.23   0.026    -.7859822   -.0504679
            age |   .0163048   .0063302     2.58   0.010     .0038979    .0287117
          educ1 |    .129317   .2252209     0.57   0.566    -.3121079    .5707419
        married |   .3309056   .1849016     1.79   0.074    -.0314948     .693306
        consump |  -.0174808   .0613392    -0.28   0.776    -.1377033    .1027418
       logpop98 |  -.0978095   .0840651    -1.16   0.245    -.2625741    .0669552
      wage98_ln |  -.1571681   .2223983    -0.71   0.480    -.5930607    .2787245
          _cons |  -.4086906   1.745925    -0.23   0.815    -3.830641    3.013259
---------------------------------------------------------------------------------
(option pr assumed; Pr(newvote_OVR_p50))
(4,658 missing values generated)

Iteration 0:   log pseudolikelihood = -163.71873  
Iteration 1:   log pseudolikelihood = -160.30224  
Iteration 2:   log pseudolikelihood = -160.25082  
Iteration 3:   log pseudolikelihood = -160.25079  
Iteration 4:   log pseudolikelihood = -160.25079  

Probit regression                               Number of obs     =        734
                                                Wald chi2(7)      =       8.79
                                                Prob > chi2       =     0.2683
Log pseudolikelihood = -160.25079               Pseudo R2         =     0.0212

---------------------------------------------------------------------------------
                |               Robust
newvote_OVR_p50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           male |   -.112659   .1773959    -0.64   0.525    -.4603486    .2350306
            age |  -.0034621   .0065656    -0.53   0.598    -.0163305    .0094063
          educ1 |   .1512983   .3220046     0.47   0.638    -.4798191    .7824158
        married |  -.0692136   .1834123    -0.38   0.706    -.4286951    .2902678
        consump |   .0487715   .0684886     0.71   0.476    -.0854636    .1830067
       logpop98 |  -.1402672   .1010105    -1.39   0.165    -.3382442    .0577098
      wage98_ln |   .0446601   .3708687     0.12   0.904    -.6822292    .7715495
          _cons |  -1.265589   2.072075    -0.61   0.541    -5.326782    2.795604
---------------------------------------------------------------------------------
(option pr assumed; Pr(newvote_OVR_p50))
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)

      pweight: kishweig
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1         Number of obs   =      1,300
Number of PSUs   =   1,300         Population size = 1,312.0491
                                   Design df       =      1,299

---------------------------------------------------------------
              |             Linearized
              |       Mean   Std. Err.     [95% Conf. Interval]
--------------+------------------------------------------------
ate_Unity_p50 |   .1911595   .0058438      .1796952    .2026237
---------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1             Number of obs   =      1,300
Number of PSUs   =   1,300             Population size = 1,312.0491
                                       Design df       =      1,299

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   Std. Err.     [95% Conf. Interval]
------------------+------------------------------------------------
new_ate_Unity_p50 |   .1825444   .0830424      .0196325    .3454562
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      1,300
Number of PSUs   =   1,300        Population size = 1,312.0491
                                  Design df       =      1,299

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
 ate_OVR_p50 |   .0559705   .0020788      .0518923    .0600487
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1           Number of obs   =      1,300
Number of PSUs   =   1,300           Population size = 1,312.0491
                                     Design df       =      1,299

-----------------------------------------------------------------
                |             Linearized
                |       Mean   Std. Err.     [95% Conf. Interval]
----------------+------------------------------------------------
new_ate_OVR_p50 |   .0609192   .0241711      .0135006    .1083378
-----------------------------------------------------------------

. 
. ************* prin results *************
. 
. 
. foreach party in  `party_list'    {
  2. 
. 
. foreach instv in  `IV_list'    {
  3. 
. *** c1: estimator1; c2: estimator2
. *** r1: point estimate; r2: standard error; r3: the lower-end point of one-sided
>  95% confidence interval
. 
. 
. matrix list results_`party'_`instv', format(%9.3f)
  4. 
. }
  5. 
. }

results_Unity_p50[3,2]
       c1     c2
r1  0.191  0.183
r2  0.083  0.083
r3  0.055  0.046

results_OVR_p50[3,2]
       c1     c2
r1  0.056  0.061
r2  0.024  0.024
r3  0.016  0.021

. 
end of do-file

. 
. * End log
. di "End date and time: $S_DATE $S_TIME"
End date and time:  7 Nov 2022 09:50:48

. log close
      name:  <unnamed>
       log:  /Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/scripts/log
> s/2022.11.07-09.50.48.log.txt
  log type:  text
 closed on:   7 Nov 2022, 09:50:48
----------------------------------------------------------------------------------
