----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/scripts/log
> s/2022.11.07-12.20.50.log.txt
  log type:  text
 opened on:   7 Nov 2022, 12:20:50

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  7 Nov 2022 12:20:50

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 30 Mar 2021

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    4

. di "OS:            `c(os)' `c(osdtl)'"
OS:            MacOSX 12.4.0

. di "Machine type:  `c(machine_type)'"
Machine type:  Mac (Apple Silicon)

. 
. * Stata version control
. version 16

. 
. * Create directories for output files
. cap mkdir "$Persuasion/results"

. 
. **********************
. * Run analysis
. **********************
. * TABLE 1. Persuasion Rates: Papers on Voter Turnout
. *do "$Persuasion/scripts/table1.do"
. 
. * Effects of Uncensored Media: Revisiting Chen and Yang (2019)
. *   To generate the dataset "ChenYang2019.dta", it is necessary to run CY19_data
> .do 
. *   after downloading the original dataset from 
. *   the AER webpage at https://www.aeaweb.org/articles?id=10.1257/aer.20171765
. *   and storing them at "$Persuasion/data/ChenYang2019".
. *   As the dataset is already created and stored at "$Persuasion/data/ChenYang20
> 19", 
. *   the do file is commented below.
. *do "$Persuasion/scripts/CY19_data.do"
. *   TABLE 2. Persuasion Rates of Exposure to Uncensored Internet
. *do "$Persuasion/scripts/table2.do"
. 
. * Effects of Political News: Revisting Gerber, Karlan, and Bergan (2009) 
. *   TABLE 3. Summary Statistics of the GKB Data
. *do "$Persuasion/scripts/table3.do"
. *   TABLE 4. Estimates of the Key Parameters
. *do "$Persuasion/scripts/table4.do"
. 
. *       TABLE E1. Persuasive Effect by Treatment in Landry et al. (2006)
. *do "$Persuasion/scripts/tableE1.do"
. 
. *       TABLE E2. Persuasive Effect by Treatment in DLM
. do "$Persuasion/scripts/tableE2.do"

. ************
. * SCRIPT:   tableE2.do
. * PURPOSE:  Creates Table E2
. *
. * ACKNOWLEDGMENT
. *       The orginal dataset "CharityOutputQJE" is from DellaVigna, List, and Mal
> mendier (QJE, 2012).
. *       The data collected in DLM are available at http://eml.berkeley.edu/~sdel
> lavi/index.html. 
. ************
. 
. ** Load data with experimental observations
. use "$Persuasion/data/DellaVignaListMalmendier2012/CharityOutputQJE.dta", clear

. memory 

  Memory usage
                                            used                allocated
    ---------------------------------------------------------------------
    data                               1,850,548               67,108,864
    strLs                                      0                        0
    ---------------------------------------------------------------------
    data & strLs                       1,850,548               67,108,864

    ---------------------------------------------------------------------
    data & strLs                       1,850,548               67,108,864
    var. names, %fmts, ...                 8,601                  100,092
    overhead                           1,081,344                1,082,136

    Stata matrices                        12,968                   12,968
    ado-files                            520,001                  520,001
    stored results                         7,795                    7,795

    Mata matrices                        138,992                  138,992
    Mata functions                       162,112                  162,112

    set maxvar usage                   5,926,954                5,926,954

    other                                408,358                  408,358
    ---------------------------------------------------------------------
    grand total                        9,566,473               75,468,272

. su

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    location |          0
   solicitor |          0
        hour |     21,514    12.62336    1.879994         10         16
   nosolsign |     21,518    .0383865    .1921319          0          1
 toeliminate |     21,518    .0286272    .1667602          0          1
-------------+---------------------------------------------------------
         dnd |      4,027    .1209337    .3260907          0          1
   didsurvey |          0
   treatment |          0
     saidyes |     21,518    .1132075    .3168537          0          1
   area_rank |     21,518    6.814992    2.591007          0         10
-------------+---------------------------------------------------------
   hypgivelo |      1,285    11.45292    12.51396          0        200
   hypgivehi |      1,285    11.96887    12.81876          0        200
     charity |          0
  amt_donate |      8,906    .7002156    5.229413          0        300
    yeslarge |      8,906    .0184146    .1344525          0          1
-------------+---------------------------------------------------------
    yessmall |      8,906     .034022    .1812959          0          1
   yeslarge2 |      8,906    .0311026    .1736048          0          1
   yessmall2 |      8,906    .0213339    .1445031          0          1
 lamt_donate |      8,906    .1228697    .5512022          0    5.70711
        date |     21,518    17929.12    216.1081      17649      18215
-------------+---------------------------------------------------------
        year |     21,518    2008.492    .4999528       2008       2009
    areamiss |     21,518    .0930849    .2905581          0          1
     minutes |     21,083    26.78219    15.63473        -22         77
      answer |     21,518    .4162562    .4929485          0          1
  charityall |          0
-------------+---------------------------------------------------------
 saidyescond |      8,957    .2715195    .4447682          0          1

. 
. ** Code treatment with 2-week warning (2Ww) together with other Warning (flyer) 
> treatments 
. replace treatment="W" if treatment=="2Ww"
(819 real changes made)

. 
. ** Initial Sample
. count
  21,518

. count if (charity=="Ecu" | charity=="LaRabida")
  8,906

. count if (charity=="Sv2008")
  2,018

. count if (charity=="Sv2009")
  10,594

. 
. *** Drop two groups of observations which the solicitors did not contact
. * I. Households with no solicitor sign
. * II. Households where solicitor could not knock on door (big dog barking, house
>  for sale, etc.)
. * Important to eliminate these observations because these households are disprop
> ortionally
. * in No-Warning treatment (since some are excluded after flyering), 
. * and have no giving/no survey completion
. * nosolsign==1 indicates that these households have a sign that they do not acce
> pt solicitors
. count if nosol==1
  826

. ta treatment nosol,row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    NoSolicitorSign
 treatment |         0          1 |     Total
-----------+----------------------+----------
        Nw |     3,583        289 |     3,872 
           |     92.54       7.46 |    100.00 
-----------+----------------------+----------
  Nw-0d10m |       647         34 |       681 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
   Nw-0d5m |     1,453        103 |     1,556 
           |     93.38       6.62 |    100.00 
-----------+----------------------+----------
   Nw-5d5m |       931         71 |     1,002 
           |     92.91       7.09 |    100.00 
-----------+----------------------+----------
        Oo |     1,122         19 |     1,141 
           |     98.33       1.67 |    100.00 
-----------+----------------------+----------
   Oo-0d5m |     1,394         23 |     1,417 
           |     98.38       1.62 |    100.00 
-----------+----------------------+----------
   Oo-5d5m |     1,365         40 |     1,405 
           |     97.15       2.85 |    100.00 
-----------+----------------------+----------
         W |     3,806         87 |     3,893 
           |     97.77       2.23 |    100.00 
-----------+----------------------+----------
   W-0d10m |     1,287         39 |     1,326 
           |     97.06       2.94 |    100.00 
-----------+----------------------+----------
    W-0d5m |     2,188         47 |     2,235 
           |     97.90       2.10 |    100.00 
-----------+----------------------+----------
  W-10d10m |       349          7 |       356 
           |     98.03       1.97 |    100.00 
-----------+----------------------+----------
   W-10d5m |       684         21 |       705 
           |     97.02       2.98 |    100.00 
-----------+----------------------+----------
    W-5d5m |     1,883         46 |     1,929 
           |     97.62       2.38 |    100.00 
-----------+----------------------+----------
     Total |    20,692        826 |    21,518 
           |     96.16       3.84 |    100.00 

. drop if nosol==1
(826 observations deleted)

. drop nosol

. count if toel==1
  565

. ta treatment toel,row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    DidNotApproach
 treatment |         0          1 |     Total
-----------+----------------------+----------
        Nw |     3,451        132 |     3,583 
           |     96.32       3.68 |    100.00 
-----------+----------------------+----------
  Nw-0d10m |       607         40 |       647 
           |     93.82       6.18 |    100.00 
-----------+----------------------+----------
   Nw-0d5m |     1,420         33 |     1,453 
           |     97.73       2.27 |    100.00 
-----------+----------------------+----------
   Nw-5d5m |       910         21 |       931 
           |     97.74       2.26 |    100.00 
-----------+----------------------+----------
        Oo |     1,090         32 |     1,122 
           |     97.15       2.85 |    100.00 
-----------+----------------------+----------
   Oo-0d5m |     1,374         20 |     1,394 
           |     98.57       1.43 |    100.00 
-----------+----------------------+----------
   Oo-5d5m |     1,330         35 |     1,365 
           |     97.44       2.56 |    100.00 
-----------+----------------------+----------
         W |     3,686        120 |     3,806 
           |     96.85       3.15 |    100.00 
-----------+----------------------+----------
   W-0d10m |     1,258         29 |     1,287 
           |     97.75       2.25 |    100.00 
-----------+----------------------+----------
    W-0d5m |     2,152         36 |     2,188 
           |     98.35       1.65 |    100.00 
-----------+----------------------+----------
  W-10d10m |       320         29 |       349 
           |     91.69       8.31 |    100.00 
-----------+----------------------+----------
   W-10d5m |       673         11 |       684 
           |     98.39       1.61 |    100.00 
-----------+----------------------+----------
    W-5d5m |     1,856         27 |     1,883 
           |     98.57       1.43 |    100.00 
-----------+----------------------+----------
     Total |    20,127        565 |    20,692 
           |     97.27       2.73 |    100.00 

. drop if toeliminate==1
(565 observations deleted)

. drop toeliminate

. ** Drop 5 solicitor-days with serious inconsistencies
. ** treatment is no-flyer, but solicitors report flyer on door throughout
. drop if sol=="Angelena" & (date==mdy(7,27,2008)|date==mdy(7,13,2008))
(198 observations deleted)

. drop if sol=="Shedora" & (date==mdy(7,27,2008)|date==mdy(8,10,2008))
(154 observations deleted)

. drop if sol=="Tehmur" & date==mdy(6,1,2008)
(83 observations deleted)

. drop if sol=="Phillip" & date==mdy(8,9,2008)
(84 observations deleted)

. drop if sol=="Robert" & date==mdy(7,13,2008) & (hour==11|hour==13)
(40 observations deleted)

. count
  19,568

. 
. ** Final Sample
. ta treatment,m

  treatment |      Freq.     Percent        Cum.
------------+-----------------------------------
         Nw |      3,166       16.18       16.18
   Nw-0d10m |        607        3.10       19.28
    Nw-0d5m |      1,420        7.26       26.54
    Nw-5d5m |        910        4.65       31.19
         Oo |      1,070        5.47       36.66
    Oo-0d5m |      1,374        7.02       43.68
    Oo-5d5m |      1,330        6.80       50.48
          W |      3,432       17.54       68.01
    W-0d10m |      1,258        6.43       74.44
     W-0d5m |      2,152       11.00       85.44
   W-10d10m |        320        1.64       87.08
    W-10d5m |        673        3.44       90.52
     W-5d5m |      1,856        9.48      100.00
------------+-----------------------------------
      Total |     19,568      100.00

. count
  19,568

. count if (charity=="Ecu" | charity=="LaRabida")
  7,668

. count if (charity=="Sv2008")
  1,865

. count if (charity=="Sv2009")
  10,035

. 
. **** Information in Experimental Design Section
. * Number of solicitors -- 92
. codebook solicitor

----------------------------------------------------------------------------------
solicitor                                                                Solicitor
----------------------------------------------------------------------------------

                  type:  string (str9)

         unique values:  92                       missing "":  0/19,568

              examples:  "Brandon"
                         "Fengping"
                         "Kuan"
                         "Rachel"

. * Number of households
. ta location year

                |         year
       Location |      2008       2009 |     Total
----------------+----------------------+----------
     Burr Ridge |     1,184        475 |     1,659 
    Countryside |         0        155 |       155 
      Flossmoor |     1,781        270 |     2,051 
     Kenilworth |       250          0 |       250 
         Lemont |     1,163        982 |     2,145 
   Libertyville |     1,330          0 |     1,330 
      Oak Brook |       735          0 |       735 
     Oak Forest |         0      1,645 |     1,645 
       Oak Park |         0      1,651 |     1,651 
    Orland Park |       368          0 |       368 
     Park Ridge |         0        703 |       703 
Rolling Meadows |     1,537        896 |     2,433 
        Roselle |     1,185          0 |     1,185 
     Schaumburg |         0        963 |       963 
 Skoke-Evanston |         0      1,755 |     1,755 
    Willowbrook |         0        540 |       540 
----------------+----------------------+----------
          Total |     9,533     10,035 |    19,568 

. 
. ** Distinguish three waves of charity data
. gen month=month(date)

. gen dwave=1 if ((month==7 | month==8) & charity =="LaRabida") & year==2008
(16,512 missing values generated)

. replace dwave=0 if ((month==4 | month==5 | month==6) | (charity=="Ecu" & month==
> 7)) & year==2008
(3,852 real changes made)

. replace dwave=2 if (month==9 | month==10) & year==2008
(2,042 real changes made)

. * Randomization by wave
. ta date dwave

           |              dwave
      date |         0          1          2 |     Total
-----------+---------------------------------+----------
 27apr2008 |     1,325          0          0 |     1,325 
 04may2008 |       456          0          0 |       456 
 10may2008 |       735          0          0 |       735 
 17may2008 |       412          0          0 |       412 
 18may2008 |       577          0          0 |       577 
 01jun2008 |       174          0          0 |       174 
 13jul2008 |         0        614          0 |       614 
 26jul2008 |       173        156          0 |       329 
 27jul2008 |         0        400          0 |       400 
 02aug2008 |         0        384          0 |       384 
 09aug2008 |         0        286          0 |       286 
 10aug2008 |         0        262          0 |       262 
 17aug2008 |         0        404          0 |       404 
 23aug2008 |         0        550          0 |       550 
 06sep2008 |         0          0        362 |       362 
 07sep2008 |         0          0         49 |        49 
 20sep2008 |         0          0        408 |       408 
 21sep2008 |         0          0         48 |        48 
 04oct2008 |         0          0        410 |       410 
 10oct2008 |         0          0        386 |       386 
 18oct2008 |         0          0        379 |       379 
-----------+---------------------------------+----------
     Total |     3,852      3,056      2,042 |     8,950 

. bys dwave: ta treatment charity if charityall=="All", column

----------------------------------------------------------------------------------
-> dwave = 0

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       638        614 |     1,252 
           |     42.31      39.61 |     40.94 
-----------+----------------------+----------
        Oo |       313        387 |       700 
           |     20.76      24.97 |     22.89 
-----------+----------------------+----------
         W |       557        549 |     1,106 
           |     36.94      35.42 |     36.17 
-----------+----------------------+----------
     Total |     1,508      1,550 |     3,058 
           |    100.00     100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 1

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Charity
 treatment |  LaRabida |     Total
-----------+-----------+----------
        Nw |     1,539 |     1,539 
           |     50.36 |     50.36 
-----------+-----------+----------
         W |     1,517 |     1,517 
           |     49.64 |     49.64 
-----------+-----------+----------
     Total |     3,056 |     3,056 
           |    100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 2

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       308         67 |       375 
           |     25.71      18.82 |     24.13 
-----------+----------------------+----------
        Oo |       275         95 |       370 
           |     22.95      26.69 |     23.81 
-----------+----------------------+----------
         W |       615        194 |       809 
           |     51.34      54.49 |     52.06 
-----------+----------------------+----------
     Total |     1,198        356 |     1,554 
           |    100.00     100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = .
no observations


. bys dwave: ta treatment charity if charityall=="All", row

----------------------------------------------------------------------------------
-> dwave = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       638        614 |     1,252 
           |     50.96      49.04 |    100.00 
-----------+----------------------+----------
        Oo |       313        387 |       700 
           |     44.71      55.29 |    100.00 
-----------+----------------------+----------
         W |       557        549 |     1,106 
           |     50.36      49.64 |    100.00 
-----------+----------------------+----------
     Total |     1,508      1,550 |     3,058 
           |     49.31      50.69 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Charity
 treatment |  LaRabida |     Total
-----------+-----------+----------
        Nw |     1,539 |     1,539 
           |    100.00 |    100.00 
-----------+-----------+----------
         W |     1,517 |     1,517 
           |    100.00 |    100.00 
-----------+-----------+----------
     Total |     3,056 |     3,056 
           |    100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 2

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       308         67 |       375 
           |     82.13      17.87 |    100.00 
-----------+----------------------+----------
        Oo |       275         95 |       370 
           |     74.32      25.68 |    100.00 
-----------+----------------------+----------
         W |       615        194 |       809 
           |     76.02      23.98 |    100.00 
-----------+----------------------+----------
     Total |     1,198        356 |     1,554 
           |     77.09      22.91 |    100.00 

----------------------------------------------------------------------------------
-> dwave = .
no observations


. 
. ** Generate fixed effects
. egen sodate=concat(solicitor date)

. egen treatmentby=concat(treatment charity)

. egen byte grsol=group(solicitor)

. egen byte grdatloc=group(date location)

. egen byte grdatlocsol=group(date location solicitor)

. egen byte grhour=group(hour)

. egen byte grarea=group(area_rank)

. drop solicitor area* hour 

. 
. char treatment[omit] "Nw"

. replace amt_donate=0 if amt==.
(11,900 real changes made)

. 
. * Save final file
. *save CharityOutputQJEFinal,replace
. 
. foreach x in "W" "Oo" {
  2.         gen d`x'=treatment=="`x'"
  3.         gen d`x'Ecu=treatment=="`x'" & charity=="Ecu"
  4.         gen d`x'Lar=treatment=="`x'" & charity=="LaRabida"
  5.         }       

. gen dEcu=charity=="Ecu"

. foreach x in "0d5m" "0d10m" "5d5m" "5d10m" "10d10m" "10d5m" {
  2.         foreach y in "Nw" "W" "Oo" {
  3.                 replace treatment="`y'`x'" if treatment=="`y'-`x'"
  4.                 }
  5.         }
(1,420 real changes made)
(2,152 real changes made)
(1,374 real changes made)
(607 real changes made)
(1,258 real changes made)
(0 real changes made)
(910 real changes made)
(1,856 real changes made)
(1,330 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(320 real changes made)
(0 real changes made)
(0 real changes made)
(673 real changes made)
(0 real changes made)

. foreach x in "Nw0d10m" "W0d10m" "W0d5m" "W10d10m" {
  2.         gen d`x'08=(treatment=="`x'" & year==2008)
  3.         }

. foreach x in "Nw0d5m" "Nw5d5m" "W0d10m" "W0d5m" "W10d5m" "W5d5m" "Oo0d5m" "Oo5d5
> m" {
  2.         gen d`x'09=treatment=="`x'" & year==2009
  3.         }

. order dNw0d10m08 dW0d10m08 dW0d5m08 dW10d10m08

. order dNw5d5m09 dW0d10m09 dW0d5m09 dW5d5m09 dW10d5m09 dOo0d5m09 dOo5d5m09

. * drop omitted category
. drop dNw0d10m08 dNw0d5m09

. compress
  variable dNw5d5m09 was float now byte
  variable dW0d10m09 was float now byte
  variable dW0d5m09 was float now byte
  variable dW5d5m09 was float now byte
  variable dW10d5m09 was float now byte
  variable dOo0d5m09 was float now byte
  variable dOo5d5m09 was float now byte
  variable dW0d10m08 was float now byte
  variable dW0d5m08 was float now byte
  variable dW10d10m08 was float now byte
  variable month was float now byte
  variable dwave was float now byte
  variable dW was float now byte
  variable dWEcu was float now byte
  variable dWLar was float now byte
  variable dOo was float now byte
  variable dOoEcu was float now byte
  variable dOoLar was float now byte
  variable dEcu was float now byte
  variable treatment was str8 now str7
  (1,134,944 bytes saved)

. 
. 
. ** Generate Summary Stats Table -- Table 1
. **bys charity: tabstat answer, stats(mean n) by(treatment)
. **bys charity: tabstat saidyes, stats(mean n) by(treatment)
. * Aggregate for ECU and LaRabida
. **tabstat answer if charityall=="All", stats(mean n) by(treatment)
. **tabstat saidyes if charityall=="All", stats(mean n) by(treatment)
. 
. 
. **************************************************
. *** Estimating parameters for persuation rates ***
. 
. local charity_list = "LaRabida Ecu"

. 
. foreach charity in  `charity_list' {
  2. 
. xi: reg answer dW dOo i.grsol i.grdatloc i.grhour i.grarea if charity=="`charity
> '", robust cluster(sodate)
  3. matrix reg_b = e(b)
  4. predict ahat if charity=="`charity'"
  5. scalar coeff_b1 = reg_b[1,1]
  6. scalar coeff_b2 = reg_b[1,2]
  7. scalar list coeff_b1 coeff_b2
  8. gen ahat_Nw = ahat - coeff_b1*dW - coeff_b2*dOo
  9. gen ahat_W  = ahat_Nw + coeff_b1
 10. gen ahat_Oo = ahat_Nw + coeff_b2
 11. replace ahat_Nw = min(max(ahat_Nw,0),1)
 12. replace ahat_W = min(max(ahat_W,0),1)
 13. replace ahat_Oo = min(max(ahat_Oo,0),1)
 14. 
. xi: reg saidyes dW dOo i.grsol i.grdatloc i.grhour i.grarea if charity=="`charit
> y'", robust cluster(sodate)
 15. matrix reg_b = e(b)
 16. predict yhat if charity=="`charity'" 
 17. scalar coeff_b1 = reg_b[1,1]
 18. scalar coeff_b2 = reg_b[1,2]
 19. scalar list coeff_b1 coeff_b2
 20. gen yhat_Nw = yhat - coeff_b1*dW - coeff_b2*dOo
 21. gen yhat_W  = yhat_Nw + coeff_b1
 22. gen yhat_Oo = yhat_Nw + coeff_b2
 23. replace yhat_Nw = min(max(yhat_Nw,0),1)
 24. replace yhat_W = min(max(yhat_W,0),1)
 25. replace yhat_Oo = min(max(yhat_Oo,0),1)
 26. 
. gen lb_Nw = yhat_Nw
 27. gen lb_W  = yhat_W
 28. gen lb_Oo = yhat_Oo
 29.   
. gen ub_Nw = yhat_Nw + 1 - ahat_Nw
 30. gen ub_W  = yhat_W  + 1 - ahat_W
 31. gen ub_Oo = yhat_Oo + 1 - ahat_Oo
 32. 
. matrix results_`charity' = J(3,5,.)
 33.   
. mean yhat_Nw ahat_Nw lb_Nw ub_Nw if charity=="`charity'" 
 34. matrix mean_tmp=e(b)
 35. matrix late_tmp=mean_tmp[1,1]/mean_tmp[1,2] 
 36. matrix results_`charity'[1,1..4] = mean_tmp[1,1..4]
 37. matrix results_`charity'[1,5] = late_tmp
 38. 
. mean yhat_W ahat_W lb_W ub_W       if charity=="`charity'"  
 39. matrix mean_tmp=e(b)
 40. matrix late_tmp=mean_tmp[1,1]/mean_tmp[1,2] 
 41. matrix results_`charity'[2,1..4] = mean_tmp[1,1..4]
 42. matrix results_`charity'[2,5] = late_tmp
 43. 
. mean yhat_Oo ahat_Oo lb_Oo ub_Oo   if charity=="`charity'"   
 44. matrix mean_tmp=e(b)
 45. matrix late_tmp=mean_tmp[1,1]/mean_tmp[1,2] 
 46. matrix results_`charity'[3,1..4] = mean_tmp[1,1..4]
 47. matrix results_`charity'[3,5] = late_tmp
 48. 
. }
i.grsol           _Igrsol_1-92        (naturally coded; _Igrsol_1 omitted)
i.grdatloc        _Igrdatloc_1-53     (naturally coded; _Igrdatloc_1 omitted)
i.grhour          _Igrhour_1-6        (naturally coded; _Igrhour_1 omitted)
i.grarea          _Igrarea_1-8        (naturally coded; _Igrarea_1 omitted)
note: _Igrsol_2 omitted because of collinearity
note: _Igrsol_3 omitted because of collinearity
note: _Igrsol_4 omitted because of collinearity
note: _Igrsol_5 omitted because of collinearity
note: _Igrsol_6 omitted because of collinearity
note: _Igrsol_8 omitted because of collinearity
note: _Igrsol_9 omitted because of collinearity
note: _Igrsol_10 omitted because of collinearity
note: _Igrsol_11 omitted because of collinearity
note: _Igrsol_12 omitted because of collinearity
note: _Igrsol_14 omitted because of collinearity
note: _Igrsol_15 omitted because of collinearity
note: _Igrsol_16 omitted because of collinearity
note: _Igrsol_18 omitted because of collinearity
note: _Igrsol_19 omitted because of collinearity
note: _Igrsol_22 omitted because of collinearity
note: _Igrsol_24 omitted because of collinearity
note: _Igrsol_25 omitted because of collinearity
note: _Igrsol_26 omitted because of collinearity
note: _Igrsol_28 omitted because of collinearity
note: _Igrsol_30 omitted because of collinearity
note: _Igrsol_31 omitted because of collinearity
note: _Igrsol_33 omitted because of collinearity
note: _Igrsol_35 omitted because of collinearity
note: _Igrsol_36 omitted because of collinearity
note: _Igrsol_37 omitted because of collinearity
note: _Igrsol_38 omitted because of collinearity
note: _Igrsol_39 omitted because of collinearity
note: _Igrsol_40 omitted because of collinearity
note: _Igrsol_41 omitted because of collinearity
note: _Igrsol_44 omitted because of collinearity
note: _Igrsol_45 omitted because of collinearity
note: _Igrsol_46 omitted because of collinearity
note: _Igrsol_47 omitted because of collinearity
note: _Igrsol_48 omitted because of collinearity
note: _Igrsol_49 omitted because of collinearity
note: _Igrsol_51 omitted because of collinearity
note: _Igrsol_52 omitted because of collinearity
note: _Igrsol_55 omitted because of collinearity
note: _Igrsol_56 omitted because of collinearity
note: _Igrsol_57 omitted because of collinearity
note: _Igrsol_59 omitted because of collinearity
note: _Igrsol_60 omitted because of collinearity
note: _Igrsol_63 omitted because of collinearity
note: _Igrsol_65 omitted because of collinearity
note: _Igrsol_66 omitted because of collinearity
note: _Igrsol_67 omitted because of collinearity
note: _Igrsol_68 omitted because of collinearity
note: _Igrsol_69 omitted because of collinearity
note: _Igrsol_71 omitted because of collinearity
note: _Igrsol_72 omitted because of collinearity
note: _Igrsol_73 omitted because of collinearity
note: _Igrsol_76 omitted because of collinearity
note: _Igrsol_78 omitted because of collinearity
note: _Igrsol_80 omitted because of collinearity
note: _Igrsol_81 omitted because of collinearity
note: _Igrsol_85 omitted because of collinearity
note: _Igrsol_86 omitted because of collinearity
note: _Igrsol_87 omitted because of collinearity
note: _Igrsol_88 omitted because of collinearity
note: _Igrsol_89 omitted because of collinearity
note: _Igrsol_90 omitted because of collinearity
note: _Igrsol_91 omitted because of collinearity
note: _Igrdatloc_4 omitted because of collinearity
note: _Igrdatloc_6 omitted because of collinearity
note: _Igrdatloc_16 omitted because of collinearity
note: _Igrdatloc_17 omitted because of collinearity
note: _Igrdatloc_18 omitted because of collinearity
note: _Igrdatloc_19 omitted because of collinearity
note: _Igrdatloc_20 omitted because of collinearity
note: _Igrdatloc_23 omitted because of collinearity
note: _Igrdatloc_24 omitted because of collinearity
note: _Igrdatloc_25 omitted because of collinearity
note: _Igrdatloc_26 omitted because of collinearity
note: _Igrdatloc_27 omitted because of collinearity
note: _Igrdatloc_28 omitted because of collinearity
note: _Igrdatloc_29 omitted because of collinearity
note: _Igrdatloc_30 omitted because of collinearity
note: _Igrdatloc_31 omitted because of collinearity
note: _Igrdatloc_32 omitted because of collinearity
note: _Igrdatloc_33 omitted because of collinearity
note: _Igrdatloc_34 omitted because of collinearity
note: _Igrdatloc_35 omitted because of collinearity
note: _Igrdatloc_36 omitted because of collinearity
note: _Igrdatloc_37 omitted because of collinearity
note: _Igrdatloc_38 omitted because of collinearity
note: _Igrdatloc_39 omitted because of collinearity
note: _Igrdatloc_40 omitted because of collinearity
note: _Igrdatloc_41 omitted because of collinearity
note: _Igrdatloc_42 omitted because of collinearity
note: _Igrdatloc_43 omitted because of collinearity
note: _Igrdatloc_44 omitted because of collinearity
note: _Igrdatloc_45 omitted because of collinearity
note: _Igrdatloc_46 omitted because of collinearity
note: _Igrdatloc_47 omitted because of collinearity
note: _Igrdatloc_48 omitted because of collinearity
note: _Igrdatloc_49 omitted because of collinearity
note: _Igrdatloc_50 omitted because of collinearity
note: _Igrdatloc_51 omitted because of collinearity
note: _Igrdatloc_52 omitted because of collinearity
note: _Igrdatloc_53 omitted because of collinearity

Linear regression                               Number of obs     =      4,962
                                                F(31, 55)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0231
                                                Root MSE          =     .48165

                                 (Std. Err. adjusted for 56 clusters in sodate)
-------------------------------------------------------------------------------
              |               Robust
       answer |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           dW |  -.0403101   .0150094    -2.69   0.010    -.0703896   -.0102305
          dOo |  -.1000542   .0332011    -3.01   0.004    -.1665907   -.0335177
    _Igrsol_2 |          0  (omitted)
    _Igrsol_3 |          0  (omitted)
    _Igrsol_4 |          0  (omitted)
    _Igrsol_5 |          0  (omitted)
    _Igrsol_6 |          0  (omitted)
    _Igrsol_7 |  -.2153119   .0638189    -3.37   0.001    -.3432079   -.0874159
    _Igrsol_8 |          0  (omitted)
    _Igrsol_9 |          0  (omitted)
   _Igrsol_10 |          0  (omitted)
   _Igrsol_11 |          0  (omitted)
   _Igrsol_12 |          0  (omitted)
   _Igrsol_13 |  -.1191992    .026614    -4.48   0.000    -.1725347   -.0658636
   _Igrsol_14 |          0  (omitted)
   _Igrsol_15 |          0  (omitted)
   _Igrsol_16 |          0  (omitted)
   _Igrsol_17 |    -.00454   .0384744    -0.12   0.906    -.0816443    .0725644
   _Igrsol_18 |          0  (omitted)
   _Igrsol_19 |          0  (omitted)
   _Igrsol_20 |   -.024775   .0516532    -0.48   0.633    -.1282904    .0787404
   _Igrsol_21 |  -.0257043   .0648292    -0.40   0.693    -.1556249    .1042163
   _Igrsol_22 |          0  (omitted)
   _Igrsol_23 |  -.0539682   .0572512    -0.94   0.350    -.1687022    .0607658
   _Igrsol_24 |          0  (omitted)
   _Igrsol_25 |          0  (omitted)
   _Igrsol_26 |          0  (omitted)
   _Igrsol_27 |    .022119   .0258502     0.86   0.396    -.0296859    .0739239
   _Igrsol_28 |          0  (omitted)
   _Igrsol_29 |  -.1801205   .0656485    -2.74   0.008    -.3116831   -.0485579
   _Igrsol_30 |          0  (omitted)
   _Igrsol_31 |          0  (omitted)
   _Igrsol_32 |  -.0341843   .0115179    -2.97   0.004    -.0572667   -.0111019
   _Igrsol_33 |          0  (omitted)
   _Igrsol_34 |  -.1104028   .0311201    -3.55   0.001    -.1727688   -.0480368
   _Igrsol_35 |          0  (omitted)
   _Igrsol_36 |          0  (omitted)
   _Igrsol_37 |          0  (omitted)
   _Igrsol_38 |          0  (omitted)
   _Igrsol_39 |          0  (omitted)
   _Igrsol_40 |          0  (omitted)
   _Igrsol_41 |          0  (omitted)
   _Igrsol_42 |  -.1622585   .0170298    -9.53   0.000    -.1963869     -.12813
   _Igrsol_43 |   .0009557   .0726688     0.01   0.990    -.1446758    .1465873
   _Igrsol_44 |          0  (omitted)
   _Igrsol_45 |          0  (omitted)
   _Igrsol_46 |          0  (omitted)
   _Igrsol_47 |          0  (omitted)
   _Igrsol_48 |          0  (omitted)
   _Igrsol_49 |          0  (omitted)
   _Igrsol_50 |  -.0630523   .0127616    -4.94   0.000    -.0886272   -.0374774
   _Igrsol_51 |          0  (omitted)
   _Igrsol_52 |          0  (omitted)
   _Igrsol_53 |  -.0500555   .0698255    -0.72   0.476    -.1899888    .0898778
   _Igrsol_54 |   -.439419   .0809259    -5.43   0.000    -.6015981   -.2772399
   _Igrsol_55 |          0  (omitted)
   _Igrsol_56 |          0  (omitted)
   _Igrsol_57 |          0  (omitted)
   _Igrsol_58 |  -.0120877   .0316785    -0.38   0.704    -.0755729    .0513975
   _Igrsol_59 |          0  (omitted)
   _Igrsol_60 |          0  (omitted)
   _Igrsol_61 |  -.2106602   .0585327    -3.60   0.001    -.3279622   -.0933581
   _Igrsol_62 |  -.0125304   .0173673    -0.72   0.474    -.0473353    .0222744
   _Igrsol_63 |          0  (omitted)
   _Igrsol_64 |  -.1451271    .059671    -2.43   0.018    -.2647105   -.0255436
   _Igrsol_65 |          0  (omitted)
   _Igrsol_66 |          0  (omitted)
   _Igrsol_67 |          0  (omitted)
   _Igrsol_68 |          0  (omitted)
   _Igrsol_69 |          0  (omitted)
   _Igrsol_70 |  -.0038216   .0420077    -0.09   0.928     -.088007    .0803637
   _Igrsol_71 |          0  (omitted)
   _Igrsol_72 |          0  (omitted)
   _Igrsol_73 |          0  (omitted)
   _Igrsol_74 |  -.0965804   .0591992    -1.63   0.109    -.2152183    .0220575
   _Igrsol_75 |   .0413149   .0531264     0.78   0.440    -.0651527    .1477825
   _Igrsol_76 |          0  (omitted)
   _Igrsol_77 |  -.1271316   .0614986    -2.07   0.043    -.2503775   -.0038857
   _Igrsol_78 |          0  (omitted)
   _Igrsol_79 |   .0517122   .0156483     3.30   0.002     .0203522    .0830721
   _Igrsol_80 |          0  (omitted)
   _Igrsol_81 |          0  (omitted)
   _Igrsol_82 |   .0060999   .0429976     0.14   0.888    -.0800692    .0922691
   _Igrsol_83 |  -.3092302   .0881606    -3.51   0.001    -.4859078   -.1325525
   _Igrsol_84 |  -.2127608   .0595019    -3.58   0.001    -.3320053   -.0935162
   _Igrsol_85 |          0  (omitted)
   _Igrsol_86 |          0  (omitted)
   _Igrsol_87 |          0  (omitted)
   _Igrsol_88 |          0  (omitted)
   _Igrsol_89 |          0  (omitted)
   _Igrsol_90 |          0  (omitted)
   _Igrsol_91 |          0  (omitted)
   _Igrsol_92 |  -.1232826   .0530338    -2.32   0.024    -.2295646   -.0170006
 _Igrdatloc_2 |   .0128714   .0222417     0.58   0.565    -.0317019    .0574447
 _Igrdatloc_3 |   .0293715   .0190221     1.54   0.128    -.0087496    .0674926
 _Igrdatloc_4 |          0  (omitted)
 _Igrdatloc_5 |   .1176862   .0362946     3.24   0.002     .0449501    .1904223
 _Igrdatloc_6 |          0  (omitted)
 _Igrdatloc_7 |   .1467393   .0582675     2.52   0.015     .0299686    .2635099
 _Igrdatloc_8 |   .0826348    .053909     1.53   0.131    -.0254011    .1906708
 _Igrdatloc_9 |   .0607548   .0535747     1.13   0.262    -.0466114    .1681209
_Igrdatloc_10 |   .0158316   .0541171     0.29   0.771    -.0926215    .1242846
_Igrdatloc_11 |   .0617666   .0567646     1.09   0.281    -.0519921    .1755253
_Igrdatloc_12 |    .068064   .0694949     0.98   0.332    -.0712068    .2073348
_Igrdatloc_13 |   .0632236   .0504029     1.25   0.215     -.037786    .1642332
_Igrdatloc_14 |   .0267737   .0512924     0.52   0.604    -.0760187     .129566
_Igrdatloc_15 |   .0536375   .0526871     1.02   0.313    -.0519498    .1592247
_Igrdatloc_16 |          0  (omitted)
_Igrdatloc_17 |          0  (omitted)
_Igrdatloc_18 |          0  (omitted)
_Igrdatloc_19 |          0  (omitted)
_Igrdatloc_20 |          0  (omitted)
_Igrdatloc_21 |   .1206635   .0531991     2.27   0.027     .0140502    .2272768
_Igrdatloc_22 |   .1445087   .0443077     3.26   0.002     .0557142    .2333032
_Igrdatloc_23 |          0  (omitted)
_Igrdatloc_24 |          0  (omitted)
_Igrdatloc_25 |          0  (omitted)
_Igrdatloc_26 |          0  (omitted)
_Igrdatloc_27 |          0  (omitted)
_Igrdatloc_28 |          0  (omitted)
_Igrdatloc_29 |          0  (omitted)
_Igrdatloc_30 |          0  (omitted)
_Igrdatloc_31 |          0  (omitted)
_Igrdatloc_32 |          0  (omitted)
_Igrdatloc_33 |          0  (omitted)
_Igrdatloc_34 |          0  (omitted)
_Igrdatloc_35 |          0  (omitted)
_Igrdatloc_36 |          0  (omitted)
_Igrdatloc_37 |          0  (omitted)
_Igrdatloc_38 |          0  (omitted)
_Igrdatloc_39 |          0  (omitted)
_Igrdatloc_40 |          0  (omitted)
_Igrdatloc_41 |          0  (omitted)
_Igrdatloc_42 |          0  (omitted)
_Igrdatloc_43 |          0  (omitted)
_Igrdatloc_44 |          0  (omitted)
_Igrdatloc_45 |          0  (omitted)
_Igrdatloc_46 |          0  (omitted)
_Igrdatloc_47 |          0  (omitted)
_Igrdatloc_48 |          0  (omitted)
_Igrdatloc_49 |          0  (omitted)
_Igrdatloc_50 |          0  (omitted)
_Igrdatloc_51 |          0  (omitted)
_Igrdatloc_52 |          0  (omitted)
_Igrdatloc_53 |          0  (omitted)
   _Igrhour_2 |  -.0113232   .0231907    -0.49   0.627    -.0577984    .0351521
   _Igrhour_3 |  -.0134292   .0241918    -0.56   0.581    -.0619105    .0350522
   _Igrhour_4 |   -.017438   .0275555    -0.63   0.529    -.0726603    .0377844
   _Igrhour_5 |  -.0093236   .0278839    -0.33   0.739    -.0652041    .0465569
   _Igrhour_6 |  -.0055916   .0254023    -0.22   0.827     -.056499    .0453158
   _Igrarea_2 |   .0990997    .064623     1.53   0.131    -.0304078    .2286072
   _Igrarea_3 |   .0062964   .0525587     0.12   0.905    -.0990335    .1116263
   _Igrarea_4 |    .025047   .0431541     0.58   0.564    -.0614359    .1115298
   _Igrarea_5 |   .0332146   .0303847     1.09   0.279    -.0276777    .0941069
   _Igrarea_6 |   .0064561   .0244383     0.26   0.793    -.0425194    .0554315
   _Igrarea_7 |   .0390378   .0274036     1.42   0.160    -.0158802    .0939558
   _Igrarea_8 |   .0669041   .0280336     2.39   0.020     .0107236    .1230846
        _cons |   .4279063   .0387716    11.04   0.000     .3502064    .5056063
-------------------------------------------------------------------------------
(option xb assumed; fitted values)
(14,606 missing values generated)
  coeff_b1 = -.04031008
  coeff_b2 = -.10005421
(14,606 missing values generated)
(14,606 missing values generated)
(14,606 missing values generated)
(14,606 real changes made)
(14,606 real changes made)
(14,606 real changes made)
i.grsol           _Igrsol_1-92        (naturally coded; _Igrsol_1 omitted)
i.grdatloc        _Igrdatloc_1-53     (naturally coded; _Igrdatloc_1 omitted)
i.grhour          _Igrhour_1-6        (naturally coded; _Igrhour_1 omitted)
i.grarea          _Igrarea_1-8        (naturally coded; _Igrarea_1 omitted)
note: _Igrsol_2 omitted because of collinearity
note: _Igrsol_3 omitted because of collinearity
note: _Igrsol_4 omitted because of collinearity
note: _Igrsol_5 omitted because of collinearity
note: _Igrsol_6 omitted because of collinearity
note: _Igrsol_8 omitted because of collinearity
note: _Igrsol_9 omitted because of collinearity
note: _Igrsol_10 omitted because of collinearity
note: _Igrsol_11 omitted because of collinearity
note: _Igrsol_12 omitted because of collinearity
note: _Igrsol_14 omitted because of collinearity
note: _Igrsol_15 omitted because of collinearity
note: _Igrsol_16 omitted because of collinearity
note: _Igrsol_18 omitted because of collinearity
note: _Igrsol_19 omitted because of collinearity
note: _Igrsol_22 omitted because of collinearity
note: _Igrsol_24 omitted because of collinearity
note: _Igrsol_25 omitted because of collinearity
note: _Igrsol_26 omitted because of collinearity
note: _Igrsol_28 omitted because of collinearity
note: _Igrsol_30 omitted because of collinearity
note: _Igrsol_31 omitted because of collinearity
note: _Igrsol_33 omitted because of collinearity
note: _Igrsol_35 omitted because of collinearity
note: _Igrsol_36 omitted because of collinearity
note: _Igrsol_37 omitted because of collinearity
note: _Igrsol_38 omitted because of collinearity
note: _Igrsol_39 omitted because of collinearity
note: _Igrsol_40 omitted because of collinearity
note: _Igrsol_41 omitted because of collinearity
note: _Igrsol_44 omitted because of collinearity
note: _Igrsol_45 omitted because of collinearity
note: _Igrsol_46 omitted because of collinearity
note: _Igrsol_47 omitted because of collinearity
note: _Igrsol_48 omitted because of collinearity
note: _Igrsol_49 omitted because of collinearity
note: _Igrsol_51 omitted because of collinearity
note: _Igrsol_52 omitted because of collinearity
note: _Igrsol_55 omitted because of collinearity
note: _Igrsol_56 omitted because of collinearity
note: _Igrsol_57 omitted because of collinearity
note: _Igrsol_59 omitted because of collinearity
note: _Igrsol_60 omitted because of collinearity
note: _Igrsol_63 omitted because of collinearity
note: _Igrsol_65 omitted because of collinearity
note: _Igrsol_66 omitted because of collinearity
note: _Igrsol_67 omitted because of collinearity
note: _Igrsol_68 omitted because of collinearity
note: _Igrsol_69 omitted because of collinearity
note: _Igrsol_71 omitted because of collinearity
note: _Igrsol_72 omitted because of collinearity
note: _Igrsol_73 omitted because of collinearity
note: _Igrsol_76 omitted because of collinearity
note: _Igrsol_78 omitted because of collinearity
note: _Igrsol_80 omitted because of collinearity
note: _Igrsol_81 omitted because of collinearity
note: _Igrsol_85 omitted because of collinearity
note: _Igrsol_86 omitted because of collinearity
note: _Igrsol_87 omitted because of collinearity
note: _Igrsol_88 omitted because of collinearity
note: _Igrsol_89 omitted because of collinearity
note: _Igrsol_90 omitted because of collinearity
note: _Igrsol_91 omitted because of collinearity
note: _Igrdatloc_4 omitted because of collinearity
note: _Igrdatloc_6 omitted because of collinearity
note: _Igrdatloc_16 omitted because of collinearity
note: _Igrdatloc_17 omitted because of collinearity
note: _Igrdatloc_18 omitted because of collinearity
note: _Igrdatloc_19 omitted because of collinearity
note: _Igrdatloc_20 omitted because of collinearity
note: _Igrdatloc_23 omitted because of collinearity
note: _Igrdatloc_24 omitted because of collinearity
note: _Igrdatloc_25 omitted because of collinearity
note: _Igrdatloc_26 omitted because of collinearity
note: _Igrdatloc_27 omitted because of collinearity
note: _Igrdatloc_28 omitted because of collinearity
note: _Igrdatloc_29 omitted because of collinearity
note: _Igrdatloc_30 omitted because of collinearity
note: _Igrdatloc_31 omitted because of collinearity
note: _Igrdatloc_32 omitted because of collinearity
note: _Igrdatloc_33 omitted because of collinearity
note: _Igrdatloc_34 omitted because of collinearity
note: _Igrdatloc_35 omitted because of collinearity
note: _Igrdatloc_36 omitted because of collinearity
note: _Igrdatloc_37 omitted because of collinearity
note: _Igrdatloc_38 omitted because of collinearity
note: _Igrdatloc_39 omitted because of collinearity
note: _Igrdatloc_40 omitted because of collinearity
note: _Igrdatloc_41 omitted because of collinearity
note: _Igrdatloc_42 omitted because of collinearity
note: _Igrdatloc_43 omitted because of collinearity
note: _Igrdatloc_44 omitted because of collinearity
note: _Igrdatloc_45 omitted because of collinearity
note: _Igrdatloc_46 omitted because of collinearity
note: _Igrdatloc_47 omitted because of collinearity
note: _Igrdatloc_48 omitted because of collinearity
note: _Igrdatloc_49 omitted because of collinearity
note: _Igrdatloc_50 omitted because of collinearity
note: _Igrdatloc_51 omitted because of collinearity
note: _Igrdatloc_52 omitted because of collinearity
note: _Igrdatloc_53 omitted because of collinearity

Linear regression                               Number of obs     =      4,962
                                                F(31, 55)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0223
                                                Root MSE          =     .24988

                                 (Std. Err. adjusted for 56 clusters in sodate)
-------------------------------------------------------------------------------
              |               Robust
      saidyes |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           dW |  -.0022597   .0079358    -0.28   0.777    -.0181634    .0136439
          dOo |  -.0176764    .014712    -1.20   0.235      -.04716    .0118072
    _Igrsol_2 |          0  (omitted)
    _Igrsol_3 |          0  (omitted)
    _Igrsol_4 |          0  (omitted)
    _Igrsol_5 |          0  (omitted)
    _Igrsol_6 |          0  (omitted)
    _Igrsol_7 |   -.068212   .0456217    -1.50   0.141    -.1596399    .0232159
    _Igrsol_8 |          0  (omitted)
    _Igrsol_9 |          0  (omitted)
   _Igrsol_10 |          0  (omitted)
   _Igrsol_11 |          0  (omitted)
   _Igrsol_12 |          0  (omitted)
   _Igrsol_13 |   .0558416    .015207     3.67   0.001     .0253661    .0863172
   _Igrsol_14 |          0  (omitted)
   _Igrsol_15 |          0  (omitted)
   _Igrsol_16 |          0  (omitted)
   _Igrsol_17 |   .0105805   .0209771     0.50   0.616    -.0314585    .0526194
   _Igrsol_18 |          0  (omitted)
   _Igrsol_19 |          0  (omitted)
   _Igrsol_20 |  -.0132316   .0441102    -0.30   0.765    -.1016304    .0751672
   _Igrsol_21 |  -.0599544   .0489215    -1.23   0.226    -.1579953    .0380864
   _Igrsol_22 |          0  (omitted)
   _Igrsol_23 |  -.0771994   .0442711    -1.74   0.087    -.1659206    .0115219
   _Igrsol_24 |          0  (omitted)
   _Igrsol_25 |          0  (omitted)
   _Igrsol_26 |          0  (omitted)
   _Igrsol_27 |   .0556877   .0152491     3.65   0.001     .0251278    .0862476
   _Igrsol_28 |          0  (omitted)
   _Igrsol_29 |  -.0729789   .0467216    -1.56   0.124     -.166611    .0206532
   _Igrsol_30 |          0  (omitted)
   _Igrsol_31 |          0  (omitted)
   _Igrsol_32 |   -.027865    .006268    -4.45   0.000    -.0404264   -.0153035
   _Igrsol_33 |          0  (omitted)
   _Igrsol_34 |  -.0103778   .0171233    -0.61   0.547    -.0446936     .023938
   _Igrsol_35 |          0  (omitted)
   _Igrsol_36 |          0  (omitted)
   _Igrsol_37 |          0  (omitted)
   _Igrsol_38 |          0  (omitted)
   _Igrsol_39 |          0  (omitted)
   _Igrsol_40 |          0  (omitted)
   _Igrsol_41 |          0  (omitted)
   _Igrsol_42 |   -.051094   .0099408    -5.14   0.000    -.0710157   -.0311723
   _Igrsol_43 |  -.0233897    .050574    -0.46   0.646    -.1247423    .0779629
   _Igrsol_44 |          0  (omitted)
   _Igrsol_45 |          0  (omitted)
   _Igrsol_46 |          0  (omitted)
   _Igrsol_47 |          0  (omitted)
   _Igrsol_48 |          0  (omitted)
   _Igrsol_49 |          0  (omitted)
   _Igrsol_50 |   -.000553   .0065343    -0.08   0.933    -.0136479    .0125419
   _Igrsol_51 |          0  (omitted)
   _Igrsol_52 |          0  (omitted)
   _Igrsol_53 |  -.0783215   .0522559    -1.50   0.140    -.1830446    .0264016
   _Igrsol_54 |  -.1357176   .0524108    -2.59   0.012    -.2407512    -.030684
   _Igrsol_55 |          0  (omitted)
   _Igrsol_56 |          0  (omitted)
   _Igrsol_57 |          0  (omitted)
   _Igrsol_58 |   .0143501   .0172797     0.83   0.410    -.0202792    .0489794
   _Igrsol_59 |          0  (omitted)
   _Igrsol_60 |          0  (omitted)
   _Igrsol_61 |  -.0820449     .04018    -2.04   0.046    -.1625673   -.0015224
   _Igrsol_62 |  -.0674709   .0096666    -6.98   0.000    -.0868432   -.0480986
   _Igrsol_63 |          0  (omitted)
   _Igrsol_64 |  -.0995971   .0441478    -2.26   0.028    -.1880712   -.0111229
   _Igrsol_65 |          0  (omitted)
   _Igrsol_66 |          0  (omitted)
   _Igrsol_67 |          0  (omitted)
   _Igrsol_68 |          0  (omitted)
   _Igrsol_69 |          0  (omitted)
   _Igrsol_70 |   .0341963   .0212143     1.61   0.113    -.0083181    .0767108
   _Igrsol_71 |          0  (omitted)
   _Igrsol_72 |          0  (omitted)
   _Igrsol_73 |          0  (omitted)
   _Igrsol_74 |  -.1334829   .0469088    -2.85   0.006    -.2274902   -.0394757
   _Igrsol_75 |  -.0146672   .0376283    -0.39   0.698     -.090076    .0607416
   _Igrsol_76 |          0  (omitted)
   _Igrsol_77 |  -.1274984   .0479236    -2.66   0.010    -.2235395   -.0314573
   _Igrsol_78 |          0  (omitted)
   _Igrsol_79 |  -.0060652   .0101138    -0.60   0.551    -.0263336    .0142033
   _Igrsol_80 |          0  (omitted)
   _Igrsol_81 |          0  (omitted)
   _Igrsol_82 |    -.00684    .023071    -0.30   0.768    -.0530752    .0393952
   _Igrsol_83 |  -.0829861   .0521468    -1.59   0.117    -.1874906    .0215184
   _Igrsol_84 |  -.1031848   .0426984    -2.42   0.019    -.1887544   -.0176153
   _Igrsol_85 |          0  (omitted)
   _Igrsol_86 |          0  (omitted)
   _Igrsol_87 |          0  (omitted)
   _Igrsol_88 |          0  (omitted)
   _Igrsol_89 |          0  (omitted)
   _Igrsol_90 |          0  (omitted)
   _Igrsol_91 |          0  (omitted)
   _Igrsol_92 |  -.0627382   .0422472    -1.49   0.143    -.1474036    .0219271
 _Igrdatloc_2 |   .0177405   .0113559     1.56   0.124    -.0050173    .0404983
 _Igrdatloc_3 |   .0333421   .0119774     2.78   0.007     .0093388    .0573454
 _Igrdatloc_4 |          0  (omitted)
 _Igrdatloc_5 |   .0620449   .0194652     3.19   0.002     .0230357    .1010541
 _Igrdatloc_6 |          0  (omitted)
 _Igrdatloc_7 |    .067278    .042057     1.60   0.115    -.0170062    .1515622
 _Igrdatloc_8 |   .0643468   .0457593     1.41   0.165    -.0273569    .1560505
 _Igrdatloc_9 |    .026619   .0424721     0.63   0.533     -.058497    .1117349
_Igrdatloc_10 |   .0385097   .0425977     0.90   0.370     -.046858    .1238775
_Igrdatloc_11 |    .010503   .0438604     0.24   0.812    -.0773952    .0984012
_Igrdatloc_12 |   .0437013   .0453402     0.96   0.339    -.0471625     .134565
_Igrdatloc_13 |   .0007378   .0375672     0.02   0.984    -.0745487    .0760242
_Igrdatloc_14 |   .0010265   .0353659     0.03   0.977    -.0698485    .0719014
_Igrdatloc_15 |   .0414349   .0448333     0.92   0.359     -.048413    .1312828
_Igrdatloc_16 |          0  (omitted)
_Igrdatloc_17 |          0  (omitted)
_Igrdatloc_18 |          0  (omitted)
_Igrdatloc_19 |          0  (omitted)
_Igrdatloc_20 |          0  (omitted)
_Igrdatloc_21 |   .0186747   .0369404     0.51   0.615    -.0553554    .0927049
_Igrdatloc_22 |   .0141618   .0327967     0.43   0.668    -.0515643    .0798879
_Igrdatloc_23 |          0  (omitted)
_Igrdatloc_24 |          0  (omitted)
_Igrdatloc_25 |          0  (omitted)
_Igrdatloc_26 |          0  (omitted)
_Igrdatloc_27 |          0  (omitted)
_Igrdatloc_28 |          0  (omitted)
_Igrdatloc_29 |          0  (omitted)
_Igrdatloc_30 |          0  (omitted)
_Igrdatloc_31 |          0  (omitted)
_Igrdatloc_32 |          0  (omitted)
_Igrdatloc_33 |          0  (omitted)
_Igrdatloc_34 |          0  (omitted)
_Igrdatloc_35 |          0  (omitted)
_Igrdatloc_36 |          0  (omitted)
_Igrdatloc_37 |          0  (omitted)
_Igrdatloc_38 |          0  (omitted)
_Igrdatloc_39 |          0  (omitted)
_Igrdatloc_40 |          0  (omitted)
_Igrdatloc_41 |          0  (omitted)
_Igrdatloc_42 |          0  (omitted)
_Igrdatloc_43 |          0  (omitted)
_Igrdatloc_44 |          0  (omitted)
_Igrdatloc_45 |          0  (omitted)
_Igrdatloc_46 |          0  (omitted)
_Igrdatloc_47 |          0  (omitted)
_Igrdatloc_48 |          0  (omitted)
_Igrdatloc_49 |          0  (omitted)
_Igrdatloc_50 |          0  (omitted)
_Igrdatloc_51 |          0  (omitted)
_Igrdatloc_52 |          0  (omitted)
_Igrdatloc_53 |          0  (omitted)
   _Igrhour_2 |  -.0156033   .0154501    -1.01   0.317    -.0465659    .0153594
   _Igrhour_3 |   -.005671   .0146069    -0.39   0.699    -.0349439    .0236019
   _Igrhour_4 |  -.0328157   .0118079    -2.78   0.007    -.0564793    -.009152
   _Igrhour_5 |  -.0175479   .0168775    -1.04   0.303    -.0513711    .0162753
   _Igrhour_6 |  -.0105454   .0146205    -0.72   0.474    -.0398455    .0187547
   _Igrarea_2 |  -.0591019   .0307657    -1.92   0.060    -.1207578     .002554
   _Igrarea_3 |  -.0370412   .0269838    -1.37   0.175    -.0911179    .0170355
   _Igrarea_4 |  -.0190407   .0241262    -0.79   0.433    -.0673907    .0293094
   _Igrarea_5 |  -.0113263   .0189381    -0.60   0.552    -.0492792    .0266266
   _Igrarea_6 |  -.0269175   .0176148    -1.53   0.132    -.0622184    .0083834
   _Igrarea_7 |  -.0107413   .0187022    -0.57   0.568    -.0482213    .0267386
   _Igrarea_8 |   .0066653   .0143978     0.46   0.645    -.0221886    .0355192
        _cons |   .1210301   .0224452     5.39   0.000     .0760488    .1660114
-------------------------------------------------------------------------------
(option xb assumed; fitted values)
(14,606 missing values generated)
  coeff_b1 = -.00225973
  coeff_b2 =  -.0176764
(14,606 missing values generated)
(14,606 missing values generated)
(14,606 missing values generated)
(14,739 real changes made)
(14,739 real changes made)
(14,942 real changes made)

Mean estimation                   Number of obs   =      4,962

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     yhat_Nw |   .0706978   .0005361      .0696468    .0717488
     ahat_Nw |   .4045399   .0009727      .4026329    .4064468
       lb_Nw |   .0706978   .0005361      .0696468    .0717488
       ub_Nw |   .6661579   .0008591      .6644737    .6678421
--------------------------------------------------------------
1..4 invalid name
r(198);

end of do-file
r(198);

end of do-file

r(198);

. do "/Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/run.do"

. **********************
. * OVERVIEW
. *   This script generates selected tables for the paper:
. *       "IDENTIFYING THE EFFECT OF PERSUASION" (Sung Jae Jun and Sokbae Lee)
. *   All data are stored in /data
. *   All tables are outputted to /results
. * 
. * SOFTWARE REQUIREMENTS
. *   Stata version 17 or newer
. *
. * PACKAGE REQUIREMENTS
. *   persuasio (can be installed by ssc install persuasio, replace)
. *   outreg (can be installed by ssc install outreg, replace)
. *
. * TO PERFORM A CLEAN RUN, DELETE THE FOLLOWING FOLDER:
. *   $Persuasion/results
. *
. * ACKNOWLEDGMENT
. *       The structure of the replication files is forked from 
. *   Illinois Workplace Wellness Study: Public Use Data Repository
. *   at https://github.com/reifjulian/illinois-wellness-data
. **********************
. 
. **********************
. * Parameters defined by user
. **********************
. 
. * "Persuasion" points to the root directory, which contains the subfolders "data
> " and "scripts"
. global Persuasion "/Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files"

. 
. * Number of bootstraps for Table 2
. * The published paper used nbt = 10000. Runtime is approximately 3 hours on an i
> Mac (M1, 2021).
. * Use nbt = 10 to check whether replication code runs without an error. 
. global nbt = 10000

. 
. * set seed for replicability 
. set seed 987975 

. 
. **********************
. **********************
. 
. * Confirm that the global for the root directory has been defined
. assert !missing("$Persuasion")

. 
. * Initialize log and record system parameters
. clear 

. set more off

. cap mkdir "$Persuasion/scripts/logs"

. cap log close
