----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/scripts/log
> s/2022.11.07-12.24.42.log.txt
  log type:  text
 opened on:   7 Nov 2022, 12:24:42

. 
. di "Begin date and time: $S_DATE $S_TIME"
Begin date and time:  7 Nov 2022 12:24:42

. di "Stata version: `c(stata_version)'"
Stata version: 16.1

. di "Updated as of: `c(born_date)'"
Updated as of: 30 Mar 2021

. di "Variant:       `=cond( c(MP),"MP",cond(c(SE),"SE",c(flavor)) )'"
Variant:       MP

. di "Processors:    `c(processors)'"
Processors:    4

. di "OS:            `c(os)' `c(osdtl)'"
OS:            MacOSX 12.4.0

. di "Machine type:  `c(machine_type)'"
Machine type:  Mac (Apple Silicon)

. 
. * Stata version control
. version 16

. 
. * Create directories for output files
. cap mkdir "$Persuasion/results"

. 
. **********************
. * Run analysis
. **********************
. * TABLE 1. Persuasion Rates: Papers on Voter Turnout
. *do "$Persuasion/scripts/table1.do"
. 
. * Effects of Uncensored Media: Revisiting Chen and Yang (2019)
. *   To generate the dataset "ChenYang2019.dta", it is necessary to run CY19_data
> .do 
. *   after downloading the original dataset from 
. *   the AER webpage at https://www.aeaweb.org/articles?id=10.1257/aer.20171765
. *   and storing them at "$Persuasion/data/ChenYang2019".
. *   As the dataset is already created and stored at "$Persuasion/data/ChenYang20
> 19", 
. *   the do file is commented below.
. *do "$Persuasion/scripts/CY19_data.do"
. *   TABLE 2. Persuasion Rates of Exposure to Uncensored Internet
. *do "$Persuasion/scripts/table2.do"
. 
. * Effects of Political News: Revisting Gerber, Karlan, and Bergan (2009) 
. *   TABLE 3. Summary Statistics of the GKB Data
. *do "$Persuasion/scripts/table3.do"
. *   TABLE 4. Estimates of the Key Parameters
. *do "$Persuasion/scripts/table4.do"
. 
. *       TABLE E1. Persuasive Effect by Treatment in Landry et al. (2006)
. *do "$Persuasion/scripts/tableE1.do"
. 
. *       TABLE E2. Persuasive Effect by Treatment in DLM
. do "$Persuasion/scripts/tableE2.do"

. ************
. * SCRIPT:   tableE2.do
. * PURPOSE:  Creates Table E2
. *
. * ACKNOWLEDGMENT
. *       The orginal dataset "CharityOutputQJE" is from DellaVigna, List, and Mal
> mendier (QJE, 2012).
. *       The data collected in DLM are available at http://eml.berkeley.edu/~sdel
> lavi/index.html. 
. ************
. 
. ** Load data with experimental observations
. use "$Persuasion/data/DellaVignaListMalmendier2012/CharityOutputQJE.dta", clear

. memory 

  Memory usage
                                            used                allocated
    ---------------------------------------------------------------------
    data                               1,850,548               67,108,864
    strLs                                      0                        0
    ---------------------------------------------------------------------
    data & strLs                       1,850,548               67,108,864

    ---------------------------------------------------------------------
    data & strLs                       1,850,548               67,108,864
    var. names, %fmts, ...                 8,601                  100,092
    overhead                           1,081,344                1,082,136

    Stata matrices                        13,944                   13,944
    ado-files                            520,001                  520,001
    stored results                       104,364                  104,364

    Mata matrices                        138,992                  138,992
    Mata functions                       162,112                  162,112

    set maxvar usage                   5,926,954                5,926,954

    other                              1,019,649                1,019,649
    ---------------------------------------------------------------------
    grand total                        9,891,801               76,177,108

. su

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    location |          0
   solicitor |          0
        hour |     21,514    12.62336    1.879994         10         16
   nosolsign |     21,518    .0383865    .1921319          0          1
 toeliminate |     21,518    .0286272    .1667602          0          1
-------------+---------------------------------------------------------
         dnd |      4,027    .1209337    .3260907          0          1
   didsurvey |          0
   treatment |          0
     saidyes |     21,518    .1132075    .3168537          0          1
   area_rank |     21,518    6.814992    2.591007          0         10
-------------+---------------------------------------------------------
   hypgivelo |      1,285    11.45292    12.51396          0        200
   hypgivehi |      1,285    11.96887    12.81876          0        200
     charity |          0
  amt_donate |      8,906    .7002156    5.229413          0        300
    yeslarge |      8,906    .0184146    .1344525          0          1
-------------+---------------------------------------------------------
    yessmall |      8,906     .034022    .1812959          0          1
   yeslarge2 |      8,906    .0311026    .1736048          0          1
   yessmall2 |      8,906    .0213339    .1445031          0          1
 lamt_donate |      8,906    .1228697    .5512022          0    5.70711
        date |     21,518    17929.12    216.1081      17649      18215
-------------+---------------------------------------------------------
        year |     21,518    2008.492    .4999528       2008       2009
    areamiss |     21,518    .0930849    .2905581          0          1
     minutes |     21,083    26.78219    15.63473        -22         77
      answer |     21,518    .4162562    .4929485          0          1
  charityall |          0
-------------+---------------------------------------------------------
 saidyescond |      8,957    .2715195    .4447682          0          1

. 
. ** Code treatment with 2-week warning (2Ww) together with other Warning (flyer) 
> treatments 
. replace treatment="W" if treatment=="2Ww"
(819 real changes made)

. 
. ** Initial Sample
. count
  21,518

. count if (charity=="Ecu" | charity=="LaRabida")
  8,906

. count if (charity=="Sv2008")
  2,018

. count if (charity=="Sv2009")
  10,594

. 
. *** Drop two groups of observations which the solicitors did not contact
. * I. Households with no solicitor sign
. * II. Households where solicitor could not knock on door (big dog barking, house
>  for sale, etc.)
. * Important to eliminate these observations because these households are disprop
> ortionally
. * in No-Warning treatment (since some are excluded after flyering), 
. * and have no giving/no survey completion
. * nosolsign==1 indicates that these households have a sign that they do not acce
> pt solicitors
. count if nosol==1
  826

. ta treatment nosol,row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    NoSolicitorSign
 treatment |         0          1 |     Total
-----------+----------------------+----------
        Nw |     3,583        289 |     3,872 
           |     92.54       7.46 |    100.00 
-----------+----------------------+----------
  Nw-0d10m |       647         34 |       681 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
   Nw-0d5m |     1,453        103 |     1,556 
           |     93.38       6.62 |    100.00 
-----------+----------------------+----------
   Nw-5d5m |       931         71 |     1,002 
           |     92.91       7.09 |    100.00 
-----------+----------------------+----------
        Oo |     1,122         19 |     1,141 
           |     98.33       1.67 |    100.00 
-----------+----------------------+----------
   Oo-0d5m |     1,394         23 |     1,417 
           |     98.38       1.62 |    100.00 
-----------+----------------------+----------
   Oo-5d5m |     1,365         40 |     1,405 
           |     97.15       2.85 |    100.00 
-----------+----------------------+----------
         W |     3,806         87 |     3,893 
           |     97.77       2.23 |    100.00 
-----------+----------------------+----------
   W-0d10m |     1,287         39 |     1,326 
           |     97.06       2.94 |    100.00 
-----------+----------------------+----------
    W-0d5m |     2,188         47 |     2,235 
           |     97.90       2.10 |    100.00 
-----------+----------------------+----------
  W-10d10m |       349          7 |       356 
           |     98.03       1.97 |    100.00 
-----------+----------------------+----------
   W-10d5m |       684         21 |       705 
           |     97.02       2.98 |    100.00 
-----------+----------------------+----------
    W-5d5m |     1,883         46 |     1,929 
           |     97.62       2.38 |    100.00 
-----------+----------------------+----------
     Total |    20,692        826 |    21,518 
           |     96.16       3.84 |    100.00 

. drop if nosol==1
(826 observations deleted)

. drop nosol

. count if toel==1
  565

. ta treatment toel,row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    DidNotApproach
 treatment |         0          1 |     Total
-----------+----------------------+----------
        Nw |     3,451        132 |     3,583 
           |     96.32       3.68 |    100.00 
-----------+----------------------+----------
  Nw-0d10m |       607         40 |       647 
           |     93.82       6.18 |    100.00 
-----------+----------------------+----------
   Nw-0d5m |     1,420         33 |     1,453 
           |     97.73       2.27 |    100.00 
-----------+----------------------+----------
   Nw-5d5m |       910         21 |       931 
           |     97.74       2.26 |    100.00 
-----------+----------------------+----------
        Oo |     1,090         32 |     1,122 
           |     97.15       2.85 |    100.00 
-----------+----------------------+----------
   Oo-0d5m |     1,374         20 |     1,394 
           |     98.57       1.43 |    100.00 
-----------+----------------------+----------
   Oo-5d5m |     1,330         35 |     1,365 
           |     97.44       2.56 |    100.00 
-----------+----------------------+----------
         W |     3,686        120 |     3,806 
           |     96.85       3.15 |    100.00 
-----------+----------------------+----------
   W-0d10m |     1,258         29 |     1,287 
           |     97.75       2.25 |    100.00 
-----------+----------------------+----------
    W-0d5m |     2,152         36 |     2,188 
           |     98.35       1.65 |    100.00 
-----------+----------------------+----------
  W-10d10m |       320         29 |       349 
           |     91.69       8.31 |    100.00 
-----------+----------------------+----------
   W-10d5m |       673         11 |       684 
           |     98.39       1.61 |    100.00 
-----------+----------------------+----------
    W-5d5m |     1,856         27 |     1,883 
           |     98.57       1.43 |    100.00 
-----------+----------------------+----------
     Total |    20,127        565 |    20,692 
           |     97.27       2.73 |    100.00 

. drop if toeliminate==1
(565 observations deleted)

. drop toeliminate

. ** Drop 5 solicitor-days with serious inconsistencies
. ** treatment is no-flyer, but solicitors report flyer on door throughout
. drop if sol=="Angelena" & (date==mdy(7,27,2008)|date==mdy(7,13,2008))
(198 observations deleted)

. drop if sol=="Shedora" & (date==mdy(7,27,2008)|date==mdy(8,10,2008))
(154 observations deleted)

. drop if sol=="Tehmur" & date==mdy(6,1,2008)
(83 observations deleted)

. drop if sol=="Phillip" & date==mdy(8,9,2008)
(84 observations deleted)

. drop if sol=="Robert" & date==mdy(7,13,2008) & (hour==11|hour==13)
(40 observations deleted)

. count
  19,568

. 
. ** Final Sample
. ta treatment,m

  treatment |      Freq.     Percent        Cum.
------------+-----------------------------------
         Nw |      3,166       16.18       16.18
   Nw-0d10m |        607        3.10       19.28
    Nw-0d5m |      1,420        7.26       26.54
    Nw-5d5m |        910        4.65       31.19
         Oo |      1,070        5.47       36.66
    Oo-0d5m |      1,374        7.02       43.68
    Oo-5d5m |      1,330        6.80       50.48
          W |      3,432       17.54       68.01
    W-0d10m |      1,258        6.43       74.44
     W-0d5m |      2,152       11.00       85.44
   W-10d10m |        320        1.64       87.08
    W-10d5m |        673        3.44       90.52
     W-5d5m |      1,856        9.48      100.00
------------+-----------------------------------
      Total |     19,568      100.00

. count
  19,568

. count if (charity=="Ecu" | charity=="LaRabida")
  7,668

. count if (charity=="Sv2008")
  1,865

. count if (charity=="Sv2009")
  10,035

. 
. **** Information in Experimental Design Section
. * Number of solicitors -- 92
. codebook solicitor

----------------------------------------------------------------------------------
solicitor                                                                Solicitor
----------------------------------------------------------------------------------

                  type:  string (str9)

         unique values:  92                       missing "":  0/19,568

              examples:  "Brandon"
                         "Fengping"
                         "Kuan"
                         "Rachel"

. * Number of households
. ta location year

                |         year
       Location |      2008       2009 |     Total
----------------+----------------------+----------
     Burr Ridge |     1,184        475 |     1,659 
    Countryside |         0        155 |       155 
      Flossmoor |     1,781        270 |     2,051 
     Kenilworth |       250          0 |       250 
         Lemont |     1,163        982 |     2,145 
   Libertyville |     1,330          0 |     1,330 
      Oak Brook |       735          0 |       735 
     Oak Forest |         0      1,645 |     1,645 
       Oak Park |         0      1,651 |     1,651 
    Orland Park |       368          0 |       368 
     Park Ridge |         0        703 |       703 
Rolling Meadows |     1,537        896 |     2,433 
        Roselle |     1,185          0 |     1,185 
     Schaumburg |         0        963 |       963 
 Skoke-Evanston |         0      1,755 |     1,755 
    Willowbrook |         0        540 |       540 
----------------+----------------------+----------
          Total |     9,533     10,035 |    19,568 

. 
. ** Distinguish three waves of charity data
. gen month=month(date)

. gen dwave=1 if ((month==7 | month==8) & charity =="LaRabida") & year==2008
(16,512 missing values generated)

. replace dwave=0 if ((month==4 | month==5 | month==6) | (charity=="Ecu" & month==
> 7)) & year==2008
(3,852 real changes made)

. replace dwave=2 if (month==9 | month==10) & year==2008
(2,042 real changes made)

. * Randomization by wave
. ta date dwave

           |              dwave
      date |         0          1          2 |     Total
-----------+---------------------------------+----------
 27apr2008 |     1,325          0          0 |     1,325 
 04may2008 |       456          0          0 |       456 
 10may2008 |       735          0          0 |       735 
 17may2008 |       412          0          0 |       412 
 18may2008 |       577          0          0 |       577 
 01jun2008 |       174          0          0 |       174 
 13jul2008 |         0        614          0 |       614 
 26jul2008 |       173        156          0 |       329 
 27jul2008 |         0        400          0 |       400 
 02aug2008 |         0        384          0 |       384 
 09aug2008 |         0        286          0 |       286 
 10aug2008 |         0        262          0 |       262 
 17aug2008 |         0        404          0 |       404 
 23aug2008 |         0        550          0 |       550 
 06sep2008 |         0          0        362 |       362 
 07sep2008 |         0          0         49 |        49 
 20sep2008 |         0          0        408 |       408 
 21sep2008 |         0          0         48 |        48 
 04oct2008 |         0          0        410 |       410 
 10oct2008 |         0          0        386 |       386 
 18oct2008 |         0          0        379 |       379 
-----------+---------------------------------+----------
     Total |     3,852      3,056      2,042 |     8,950 

. bys dwave: ta treatment charity if charityall=="All", column

----------------------------------------------------------------------------------
-> dwave = 0

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       638        614 |     1,252 
           |     42.31      39.61 |     40.94 
-----------+----------------------+----------
        Oo |       313        387 |       700 
           |     20.76      24.97 |     22.89 
-----------+----------------------+----------
         W |       557        549 |     1,106 
           |     36.94      35.42 |     36.17 
-----------+----------------------+----------
     Total |     1,508      1,550 |     3,058 
           |    100.00     100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 1

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Charity
 treatment |  LaRabida |     Total
-----------+-----------+----------
        Nw |     1,539 |     1,539 
           |     50.36 |     50.36 
-----------+-----------+----------
         W |     1,517 |     1,517 
           |     49.64 |     49.64 
-----------+-----------+----------
     Total |     3,056 |     3,056 
           |    100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 2

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       308         67 |       375 
           |     25.71      18.82 |     24.13 
-----------+----------------------+----------
        Oo |       275         95 |       370 
           |     22.95      26.69 |     23.81 
-----------+----------------------+----------
         W |       615        194 |       809 
           |     51.34      54.49 |     52.06 
-----------+----------------------+----------
     Total |     1,198        356 |     1,554 
           |    100.00     100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = .
no observations


. bys dwave: ta treatment charity if charityall=="All", row

----------------------------------------------------------------------------------
-> dwave = 0

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       638        614 |     1,252 
           |     50.96      49.04 |    100.00 
-----------+----------------------+----------
        Oo |       313        387 |       700 
           |     44.71      55.29 |    100.00 
-----------+----------------------+----------
         W |       557        549 |     1,106 
           |     50.36      49.64 |    100.00 
-----------+----------------------+----------
     Total |     1,508      1,550 |     3,058 
           |     49.31      50.69 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 1

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Charity
 treatment |  LaRabida |     Total
-----------+-----------+----------
        Nw |     1,539 |     1,539 
           |    100.00 |    100.00 
-----------+-----------+----------
         W |     1,517 |     1,517 
           |    100.00 |    100.00 
-----------+-----------+----------
     Total |     3,056 |     3,056 
           |    100.00 |    100.00 

----------------------------------------------------------------------------------
-> dwave = 2

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        Charity
 treatment |       Ecu   LaRabida |     Total
-----------+----------------------+----------
        Nw |       308         67 |       375 
           |     82.13      17.87 |    100.00 
-----------+----------------------+----------
        Oo |       275         95 |       370 
           |     74.32      25.68 |    100.00 
-----------+----------------------+----------
         W |       615        194 |       809 
           |     76.02      23.98 |    100.00 
-----------+----------------------+----------
     Total |     1,198        356 |     1,554 
           |     77.09      22.91 |    100.00 

----------------------------------------------------------------------------------
-> dwave = .
no observations


. 
. ** Generate fixed effects
. egen sodate=concat(solicitor date)

. egen treatmentby=concat(treatment charity)

. egen byte grsol=group(solicitor)

. egen byte grdatloc=group(date location)

. egen byte grdatlocsol=group(date location solicitor)

. egen byte grhour=group(hour)

. egen byte grarea=group(area_rank)

. drop solicitor area* hour 

. 
. char treatment[omit] "Nw"

. replace amt_donate=0 if amt==.
(11,900 real changes made)

. 
. * Save final file
. *save CharityOutputQJEFinal,replace
. 
. foreach x in "W" "Oo" {
  2.         gen d`x'=treatment=="`x'"
  3.         gen d`x'Ecu=treatment=="`x'" & charity=="Ecu"
  4.         gen d`x'Lar=treatment=="`x'" & charity=="LaRabida"
  5.         }       

. gen dEcu=charity=="Ecu"

. foreach x in "0d5m" "0d10m" "5d5m" "5d10m" "10d10m" "10d5m" {
  2.         foreach y in "Nw" "W" "Oo" {
  3.                 replace treatment="`y'`x'" if treatment=="`y'-`x'"
  4.                 }
  5.         }
(1,420 real changes made)
(2,152 real changes made)
(1,374 real changes made)
(607 real changes made)
(1,258 real changes made)
(0 real changes made)
(910 real changes made)
(1,856 real changes made)
(1,330 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(320 real changes made)
(0 real changes made)
(0 real changes made)
(673 real changes made)
(0 real changes made)

. foreach x in "Nw0d10m" "W0d10m" "W0d5m" "W10d10m" {
  2.         gen d`x'08=(treatment=="`x'" & year==2008)
  3.         }

. foreach x in "Nw0d5m" "Nw5d5m" "W0d10m" "W0d5m" "W10d5m" "W5d5m" "Oo0d5m" "Oo5d5
> m" {
  2.         gen d`x'09=treatment=="`x'" & year==2009
  3.         }

. order dNw0d10m08 dW0d10m08 dW0d5m08 dW10d10m08

. order dNw5d5m09 dW0d10m09 dW0d5m09 dW5d5m09 dW10d5m09 dOo0d5m09 dOo5d5m09

. * drop omitted category
. drop dNw0d10m08 dNw0d5m09

. compress
  variable dNw5d5m09 was float now byte
  variable dW0d10m09 was float now byte
  variable dW0d5m09 was float now byte
  variable dW5d5m09 was float now byte
  variable dW10d5m09 was float now byte
  variable dOo0d5m09 was float now byte
  variable dOo5d5m09 was float now byte
  variable dW0d10m08 was float now byte
  variable dW0d5m08 was float now byte
  variable dW10d10m08 was float now byte
  variable month was float now byte
  variable dwave was float now byte
  variable dW was float now byte
  variable dWEcu was float now byte
  variable dWLar was float now byte
  variable dOo was float now byte
  variable dOoEcu was float now byte
  variable dOoLar was float now byte
  variable dEcu was float now byte
  variable treatment was str8 now str7
  (1,134,944 bytes saved)

. 
. 
. ** Generate Summary Stats Table -- Table 1
. **bys charity: tabstat answer, stats(mean n) by(treatment)
. **bys charity: tabstat saidyes, stats(mean n) by(treatment)
. * Aggregate for ECU and LaRabida
. **tabstat answer if charityall=="All", stats(mean n) by(treatment)
. **tabstat saidyes if charityall=="All", stats(mean n) by(treatment)
. 
. 
. **************************************************
. *** Estimating parameters for persuation rates ***
. 
. local charity_list = "LaRabida Ecu"

. 
. foreach charity in  `charity_list' {
  2. 
. xi: reg answer dW dOo i.grsol i.grdatloc i.grhour i.grarea if charity=="`charity
> '", robust cluster(sodate)
  3. matrix reg_b = e(b)
  4. predict ahat if charity=="`charity'"
  5. scalar coeff_b1 = reg_b[1,1]
  6. scalar coeff_b2 = reg_b[1,2]
  7. scalar list coeff_b1 coeff_b2
  8. gen ahat_Nw = ahat - coeff_b1*dW - coeff_b2*dOo
  9. gen ahat_W  = ahat_Nw + coeff_b1
 10. gen ahat_Oo = ahat_Nw + coeff_b2
 11. replace ahat_Nw = min(max(ahat_Nw,0),1)
 12. replace ahat_W = min(max(ahat_W,0),1)
 13. replace ahat_Oo = min(max(ahat_Oo,0),1)
 14. 
. xi: reg saidyes dW dOo i.grsol i.grdatloc i.grhour i.grarea if charity=="`charit
> y'", robust cluster(sodate)
 15. matrix reg_b = e(b)
 16. predict yhat if charity=="`charity'" 
 17. scalar coeff_b1 = reg_b[1,1]
 18. scalar coeff_b2 = reg_b[1,2]
 19. scalar list coeff_b1 coeff_b2
 20. gen yhat_Nw = yhat - coeff_b1*dW - coeff_b2*dOo
 21. gen yhat_W  = yhat_Nw + coeff_b1
 22. gen yhat_Oo = yhat_Nw + coeff_b2
 23. replace yhat_Nw = min(max(yhat_Nw,0),1)
 24. replace yhat_W = min(max(yhat_W,0),1)
 25. replace yhat_Oo = min(max(yhat_Oo,0),1)
 26. 
. gen lb_Nw = yhat_Nw
 27. gen lb_W  = yhat_W
 28. gen lb_Oo = yhat_Oo
 29.   
. gen ub_Nw = yhat_Nw + 1 - ahat_Nw
 30. gen ub_W  = yhat_W  + 1 - ahat_W
 31. gen ub_Oo = yhat_Oo + 1 - ahat_Oo
 32. 
. matrix results_`charity' = J(3,5,.)
 33.   
. mean yhat_Nw ahat_Nw lb_Nw ub_Nw if charity=="`charity'" 
 34. matrix mean_tmp=e(b)
 35. matrix late_tmp=mean_tmp[1,1]/mean_tmp[1,2] 
 36. matrix results_`charity'[1,1] = mean_tmp[1,1]
 37. matrix results_`charity'[1,2] = mean_tmp[1,2]
 38. matrix results_`charity'[1,3] = mean_tmp[1,3]
 39. matrix results_`charity'[1,4] = mean_tmp[1,4]
 40. matrix results_`charity'[1,5] = late_tmp
 41. 
. mean yhat_W ahat_W lb_W ub_W       if charity=="`charity'"  
 42. matrix mean_tmp=e(b)
 43. matrix late_tmp=mean_tmp[1,1]/mean_tmp[1,2] 
 44. matrix results_`charity'[1,1] = mean_tmp[1,1]
 45. matrix results_`charity'[1,2] = mean_tmp[1,2]
 46. matrix results_`charity'[1,3] = mean_tmp[1,3]
 47. matrix results_`charity'[1,4] = mean_tmp[1,4]
 48. matrix results_`charity'[1,5] = late_tmp
 49. 
. mean yhat_Oo ahat_Oo lb_Oo ub_Oo   if charity=="`charity'"   
 50. matrix mean_tmp=e(b)
 51. matrix late_tmp=mean_tmp[1,1]/mean_tmp[1,2] 
 52. matrix results_`charity'[1,1] = mean_tmp[1,1]
 53. matrix results_`charity'[1,2] = mean_tmp[1,2]
 54. matrix results_`charity'[1,3] = mean_tmp[1,3]
 55. matrix results_`charity'[1,4] = mean_tmp[1,4]
 56. matrix results_`charity'[1,5] = late_tmp
 57. 
. drop ahat ahat_* yhat yhat_* lb_* ub_*
 58. 
. }
i.grsol           _Igrsol_1-92        (naturally coded; _Igrsol_1 omitted)
i.grdatloc        _Igrdatloc_1-53     (naturally coded; _Igrdatloc_1 omitted)
i.grhour          _Igrhour_1-6        (naturally coded; _Igrhour_1 omitted)
i.grarea          _Igrarea_1-8        (naturally coded; _Igrarea_1 omitted)
note: _Igrsol_2 omitted because of collinearity
note: _Igrsol_3 omitted because of collinearity
note: _Igrsol_4 omitted because of collinearity
note: _Igrsol_5 omitted because of collinearity
note: _Igrsol_6 omitted because of collinearity
note: _Igrsol_8 omitted because of collinearity
note: _Igrsol_9 omitted because of collinearity
note: _Igrsol_10 omitted because of collinearity
note: _Igrsol_11 omitted because of collinearity
note: _Igrsol_12 omitted because of collinearity
note: _Igrsol_14 omitted because of collinearity
note: _Igrsol_15 omitted because of collinearity
note: _Igrsol_16 omitted because of collinearity
note: _Igrsol_18 omitted because of collinearity
note: _Igrsol_19 omitted because of collinearity
note: _Igrsol_22 omitted because of collinearity
note: _Igrsol_24 omitted because of collinearity
note: _Igrsol_25 omitted because of collinearity
note: _Igrsol_26 omitted because of collinearity
note: _Igrsol_28 omitted because of collinearity
note: _Igrsol_30 omitted because of collinearity
note: _Igrsol_31 omitted because of collinearity
note: _Igrsol_33 omitted because of collinearity
note: _Igrsol_35 omitted because of collinearity
note: _Igrsol_36 omitted because of collinearity
note: _Igrsol_37 omitted because of collinearity
note: _Igrsol_38 omitted because of collinearity
note: _Igrsol_39 omitted because of collinearity
note: _Igrsol_40 omitted because of collinearity
note: _Igrsol_41 omitted because of collinearity
note: _Igrsol_44 omitted because of collinearity
note: _Igrsol_45 omitted because of collinearity
note: _Igrsol_46 omitted because of collinearity
note: _Igrsol_48 omitted because of collinearity
note: _Igrsol_49 omitted because of collinearity
note: _Igrsol_51 omitted because of collinearity
note: _Igrsol_52 omitted because of collinearity
note: _Igrsol_55 omitted because of collinearity
note: _Igrsol_56 omitted because of collinearity
note: _Igrsol_57 omitted because of collinearity
note: _Igrsol_59 omitted because of collinearity
note: _Igrsol_60 omitted because of collinearity
note: _Igrsol_63 omitted because of collinearity
note: _Igrsol_65 omitted because of collinearity
note: _Igrsol_66 omitted because of collinearity
note: _Igrsol_67 omitted because of collinearity
note: _Igrsol_68 omitted because of collinearity
note: _Igrsol_69 omitted because of collinearity
note: _Igrsol_71 omitted because of collinearity
note: _Igrsol_72 omitted because of collinearity
note: _Igrsol_73 omitted because of collinearity
note: _Igrsol_76 omitted because of collinearity
note: _Igrsol_78 omitted because of collinearity
note: _Igrsol_79 omitted because of collinearity
note: _Igrsol_80 omitted because of collinearity
note: _Igrsol_81 omitted because of collinearity
note: _Igrsol_85 omitted because of collinearity
note: _Igrsol_86 omitted because of collinearity
note: _Igrsol_87 omitted because of collinearity
note: _Igrsol_88 omitted because of collinearity
note: _Igrsol_89 omitted because of collinearity
note: _Igrsol_90 omitted because of collinearity
note: _Igrsol_91 omitted because of collinearity
note: _Igrdatloc_4 omitted because of collinearity
note: _Igrdatloc_6 omitted because of collinearity
note: _Igrdatloc_16 omitted because of collinearity
note: _Igrdatloc_17 omitted because of collinearity
note: _Igrdatloc_18 omitted because of collinearity
note: _Igrdatloc_19 omitted because of collinearity
note: _Igrdatloc_20 omitted because of collinearity
note: _Igrdatloc_23 omitted because of collinearity
note: _Igrdatloc_24 omitted because of collinearity
note: _Igrdatloc_25 omitted because of collinearity
note: _Igrdatloc_26 omitted because of collinearity
note: _Igrdatloc_27 omitted because of collinearity
note: _Igrdatloc_28 omitted because of collinearity
note: _Igrdatloc_29 omitted because of collinearity
note: _Igrdatloc_30 omitted because of collinearity
note: _Igrdatloc_31 omitted because of collinearity
note: _Igrdatloc_32 omitted because of collinearity
note: _Igrdatloc_33 omitted because of collinearity
note: _Igrdatloc_34 omitted because of collinearity
note: _Igrdatloc_35 omitted because of collinearity
note: _Igrdatloc_36 omitted because of collinearity
note: _Igrdatloc_37 omitted because of collinearity
note: _Igrdatloc_38 omitted because of collinearity
note: _Igrdatloc_39 omitted because of collinearity
note: _Igrdatloc_40 omitted because of collinearity
note: _Igrdatloc_41 omitted because of collinearity
note: _Igrdatloc_42 omitted because of collinearity
note: _Igrdatloc_43 omitted because of collinearity
note: _Igrdatloc_44 omitted because of collinearity
note: _Igrdatloc_45 omitted because of collinearity
note: _Igrdatloc_46 omitted because of collinearity
note: _Igrdatloc_47 omitted because of collinearity
note: _Igrdatloc_48 omitted because of collinearity
note: _Igrdatloc_49 omitted because of collinearity
note: _Igrdatloc_50 omitted because of collinearity
note: _Igrdatloc_51 omitted because of collinearity
note: _Igrdatloc_52 omitted because of collinearity
note: _Igrdatloc_53 omitted because of collinearity

Linear regression                               Number of obs     =      4,962
                                                F(31, 55)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0231
                                                Root MSE          =     .48165

                                 (Std. Err. adjusted for 56 clusters in sodate)
-------------------------------------------------------------------------------
              |               Robust
       answer |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           dW |  -.0403101   .0150094    -2.69   0.010    -.0703896   -.0102305
          dOo |  -.1000542   .0332011    -3.01   0.004    -.1665907   -.0335177
    _Igrsol_2 |          0  (omitted)
    _Igrsol_3 |          0  (omitted)
    _Igrsol_4 |          0  (omitted)
    _Igrsol_5 |          0  (omitted)
    _Igrsol_6 |          0  (omitted)
    _Igrsol_7 |  -.2153119   .0638189    -3.37   0.001    -.3432079   -.0874159
    _Igrsol_8 |          0  (omitted)
    _Igrsol_9 |          0  (omitted)
   _Igrsol_10 |          0  (omitted)
   _Igrsol_11 |          0  (omitted)
   _Igrsol_12 |          0  (omitted)
   _Igrsol_13 |  -.1191992    .026614    -4.48   0.000    -.1725347   -.0658636
   _Igrsol_14 |          0  (omitted)
   _Igrsol_15 |          0  (omitted)
   _Igrsol_16 |          0  (omitted)
   _Igrsol_17 |    -.00454   .0384744    -0.12   0.906    -.0816443    .0725644
   _Igrsol_18 |          0  (omitted)
   _Igrsol_19 |          0  (omitted)
   _Igrsol_20 |   -.024775   .0516532    -0.48   0.633    -.1282904    .0787404
   _Igrsol_21 |  -.0257043   .0648292    -0.40   0.693    -.1556249    .1042163
   _Igrsol_22 |          0  (omitted)
   _Igrsol_23 |  -.0539682   .0572512    -0.94   0.350    -.1687022    .0607658
   _Igrsol_24 |          0  (omitted)
   _Igrsol_25 |          0  (omitted)
   _Igrsol_26 |          0  (omitted)
   _Igrsol_27 |    .022119   .0258502     0.86   0.396    -.0296859    .0739239
   _Igrsol_28 |          0  (omitted)
   _Igrsol_29 |  -.1801205   .0656485    -2.74   0.008    -.3116831   -.0485579
   _Igrsol_30 |          0  (omitted)
   _Igrsol_31 |          0  (omitted)
   _Igrsol_32 |  -.0858965   .0226866    -3.79   0.000    -.1313614   -.0404316
   _Igrsol_33 |          0  (omitted)
   _Igrsol_34 |  -.1104028   .0311201    -3.55   0.001    -.1727688   -.0480368
   _Igrsol_35 |          0  (omitted)
   _Igrsol_36 |          0  (omitted)
   _Igrsol_37 |          0  (omitted)
   _Igrsol_38 |          0  (omitted)
   _Igrsol_39 |          0  (omitted)
   _Igrsol_40 |          0  (omitted)
   _Igrsol_41 |          0  (omitted)
   _Igrsol_42 |  -.2139706    .017517   -12.22   0.000    -.2490754   -.1788659
   _Igrsol_43 |   .0009557   .0726688     0.01   0.990    -.1446758    .1465873
   _Igrsol_44 |          0  (omitted)
   _Igrsol_45 |          0  (omitted)
   _Igrsol_46 |          0  (omitted)
   _Igrsol_47 |  -.0517122   .0156483    -3.30   0.002    -.0830721   -.0203522
   _Igrsol_48 |          0  (omitted)
   _Igrsol_49 |          0  (omitted)
   _Igrsol_50 |  -.1147645   .0133451    -8.60   0.000    -.1415087   -.0880203
   _Igrsol_51 |          0  (omitted)
   _Igrsol_52 |          0  (omitted)
   _Igrsol_53 |  -.0500555   .0698255    -0.72   0.476    -.1899888    .0898778
   _Igrsol_54 |   -.439419   .0809259    -5.43   0.000    -.6015981   -.2772399
   _Igrsol_55 |          0  (omitted)
   _Igrsol_56 |          0  (omitted)
   _Igrsol_57 |          0  (omitted)
   _Igrsol_58 |  -.0120877   .0316785    -0.38   0.704    -.0755729    .0513975
   _Igrsol_59 |          0  (omitted)
   _Igrsol_60 |          0  (omitted)
   _Igrsol_61 |  -.2106602   .0585327    -3.60   0.001    -.3279622   -.0933581
   _Igrsol_62 |  -.0125304   .0173673    -0.72   0.474    -.0473353    .0222744
   _Igrsol_63 |          0  (omitted)
   _Igrsol_64 |  -.1451271    .059671    -2.43   0.018    -.2647105   -.0255436
   _Igrsol_65 |          0  (omitted)
   _Igrsol_66 |          0  (omitted)
   _Igrsol_67 |          0  (omitted)
   _Igrsol_68 |          0  (omitted)
   _Igrsol_69 |          0  (omitted)
   _Igrsol_70 |  -.0038216   .0420077    -0.09   0.928     -.088007    .0803637
   _Igrsol_71 |          0  (omitted)
   _Igrsol_72 |          0  (omitted)
   _Igrsol_73 |          0  (omitted)
   _Igrsol_74 |  -.0965804   .0591992    -1.63   0.109    -.2152183    .0220575
   _Igrsol_75 |   .0413149   .0531264     0.78   0.440    -.0651527    .1477825
   _Igrsol_76 |          0  (omitted)
   _Igrsol_77 |  -.1271316   .0614986    -2.07   0.043    -.2503775   -.0038857
   _Igrsol_78 |          0  (omitted)
   _Igrsol_79 |          0  (omitted)
   _Igrsol_80 |          0  (omitted)
   _Igrsol_81 |          0  (omitted)
   _Igrsol_82 |   .0060999   .0429976     0.14   0.888    -.0800692    .0922691
   _Igrsol_83 |  -.3092302   .0881606    -3.51   0.001    -.4859078   -.1325525
   _Igrsol_84 |  -.2127608   .0595019    -3.58   0.001    -.3320053   -.0935162
   _Igrsol_85 |          0  (omitted)
   _Igrsol_86 |          0  (omitted)
   _Igrsol_87 |          0  (omitted)
   _Igrsol_88 |          0  (omitted)
   _Igrsol_89 |          0  (omitted)
   _Igrsol_90 |          0  (omitted)
   _Igrsol_91 |          0  (omitted)
   _Igrsol_92 |  -.1232826   .0530338    -2.32   0.024    -.2295646   -.0170006
 _Igrdatloc_2 |   .0645836   .0323304     2.00   0.051    -.0002079    .1293751
 _Igrdatloc_3 |   .0293715   .0190221     1.54   0.128    -.0087496    .0674926
 _Igrdatloc_4 |          0  (omitted)
 _Igrdatloc_5 |   .1693984    .047719     3.55   0.001     .0737673    .2650294
 _Igrdatloc_6 |          0  (omitted)
 _Igrdatloc_7 |   .1467393   .0582675     2.52   0.015     .0299686    .2635099
 _Igrdatloc_8 |   .0826348    .053909     1.53   0.131    -.0254011    .1906708
 _Igrdatloc_9 |   .0607548   .0535747     1.13   0.262    -.0466114    .1681209
_Igrdatloc_10 |   .0158316   .0541171     0.29   0.771    -.0926215    .1242846
_Igrdatloc_11 |   .0617666   .0567646     1.09   0.281    -.0519921    .1755253
_Igrdatloc_12 |    .068064   .0694949     0.98   0.332    -.0712068    .2073348
_Igrdatloc_13 |   .0632236   .0504029     1.25   0.215     -.037786    .1642332
_Igrdatloc_14 |   .0267737   .0512924     0.52   0.604    -.0760187     .129566
_Igrdatloc_15 |   .0536375   .0526871     1.02   0.313    -.0519498    .1592247
_Igrdatloc_16 |          0  (omitted)
_Igrdatloc_17 |          0  (omitted)
_Igrdatloc_18 |          0  (omitted)
_Igrdatloc_19 |          0  (omitted)
_Igrdatloc_20 |          0  (omitted)
_Igrdatloc_21 |   .1206635   .0531991     2.27   0.027     .0140502    .2272768
_Igrdatloc_22 |   .1445087   .0443077     3.26   0.002     .0557142    .2333032
_Igrdatloc_23 |          0  (omitted)
_Igrdatloc_24 |          0  (omitted)
_Igrdatloc_25 |          0  (omitted)
_Igrdatloc_26 |          0  (omitted)
_Igrdatloc_27 |          0  (omitted)
_Igrdatloc_28 |          0  (omitted)
_Igrdatloc_29 |          0  (omitted)
_Igrdatloc_30 |          0  (omitted)
_Igrdatloc_31 |          0  (omitted)
_Igrdatloc_32 |          0  (omitted)
_Igrdatloc_33 |          0  (omitted)
_Igrdatloc_34 |          0  (omitted)
_Igrdatloc_35 |          0  (omitted)
_Igrdatloc_36 |          0  (omitted)
_Igrdatloc_37 |          0  (omitted)
_Igrdatloc_38 |          0  (omitted)
_Igrdatloc_39 |          0  (omitted)
_Igrdatloc_40 |          0  (omitted)
_Igrdatloc_41 |          0  (omitted)
_Igrdatloc_42 |          0  (omitted)
_Igrdatloc_43 |          0  (omitted)
_Igrdatloc_44 |          0  (omitted)
_Igrdatloc_45 |          0  (omitted)
_Igrdatloc_46 |          0  (omitted)
_Igrdatloc_47 |          0  (omitted)
_Igrdatloc_48 |          0  (omitted)
_Igrdatloc_49 |          0  (omitted)
_Igrdatloc_50 |          0  (omitted)
_Igrdatloc_51 |          0  (omitted)
_Igrdatloc_52 |          0  (omitted)
_Igrdatloc_53 |          0  (omitted)
   _Igrhour_2 |  -.0113232   .0231907    -0.49   0.627    -.0577984    .0351521
   _Igrhour_3 |  -.0134292   .0241918    -0.56   0.581    -.0619105    .0350522
   _Igrhour_4 |   -.017438   .0275555    -0.63   0.529    -.0726603    .0377844
   _Igrhour_5 |  -.0093236   .0278839    -0.33   0.739    -.0652041    .0465569
   _Igrhour_6 |  -.0055916   .0254023    -0.22   0.827     -.056499    .0453158
   _Igrarea_2 |   .0990997    .064623     1.53   0.131    -.0304078    .2286072
   _Igrarea_3 |   .0062964   .0525587     0.12   0.905    -.0990335    .1116263
   _Igrarea_4 |    .025047   .0431541     0.58   0.564    -.0614359    .1115298
   _Igrarea_5 |   .0332146   .0303847     1.09   0.279    -.0276777    .0941069
   _Igrarea_6 |   .0064561   .0244383     0.26   0.793    -.0425194    .0554315
   _Igrarea_7 |   .0390378   .0274036     1.42   0.160    -.0158802    .0939558
   _Igrarea_8 |   .0669041   .0280336     2.39   0.020     .0107236    .1230846
        _cons |   .4279063   .0387716    11.04   0.000     .3502064    .5056063
-------------------------------------------------------------------------------
(option xb assumed; fitted values)
(14,606 missing values generated)
  coeff_b1 = -.04031008
  coeff_b2 = -.10005421
(14,606 missing values generated)
(14,606 missing values generated)
(14,606 missing values generated)
(14,606 real changes made)
(14,606 real changes made)
(14,606 real changes made)
i.grsol           _Igrsol_1-92        (naturally coded; _Igrsol_1 omitted)
i.grdatloc        _Igrdatloc_1-53     (naturally coded; _Igrdatloc_1 omitted)
i.grhour          _Igrhour_1-6        (naturally coded; _Igrhour_1 omitted)
i.grarea          _Igrarea_1-8        (naturally coded; _Igrarea_1 omitted)
note: _Igrsol_2 omitted because of collinearity
note: _Igrsol_3 omitted because of collinearity
note: _Igrsol_4 omitted because of collinearity
note: _Igrsol_5 omitted because of collinearity
note: _Igrsol_6 omitted because of collinearity
note: _Igrsol_8 omitted because of collinearity
note: _Igrsol_9 omitted because of collinearity
note: _Igrsol_10 omitted because of collinearity
note: _Igrsol_11 omitted because of collinearity
note: _Igrsol_12 omitted because of collinearity
note: _Igrsol_14 omitted because of collinearity
note: _Igrsol_15 omitted because of collinearity
note: _Igrsol_16 omitted because of collinearity
note: _Igrsol_18 omitted because of collinearity
note: _Igrsol_19 omitted because of collinearity
note: _Igrsol_22 omitted because of collinearity
note: _Igrsol_24 omitted because of collinearity
note: _Igrsol_25 omitted because of collinearity
note: _Igrsol_26 omitted because of collinearity
note: _Igrsol_28 omitted because of collinearity
note: _Igrsol_30 omitted because of collinearity
note: _Igrsol_31 omitted because of collinearity
note: _Igrsol_33 omitted because of collinearity
note: _Igrsol_35 omitted because of collinearity
note: _Igrsol_36 omitted because of collinearity
note: _Igrsol_37 omitted because of collinearity
note: _Igrsol_38 omitted because of collinearity
note: _Igrsol_39 omitted because of collinearity
note: _Igrsol_40 omitted because of collinearity
note: _Igrsol_41 omitted because of collinearity
note: _Igrsol_44 omitted because of collinearity
note: _Igrsol_45 omitted because of collinearity
note: _Igrsol_46 omitted because of collinearity
note: _Igrsol_48 omitted because of collinearity
note: _Igrsol_49 omitted because of collinearity
note: _Igrsol_51 omitted because of collinearity
note: _Igrsol_52 omitted because of collinearity
note: _Igrsol_55 omitted because of collinearity
note: _Igrsol_56 omitted because of collinearity
note: _Igrsol_57 omitted because of collinearity
note: _Igrsol_59 omitted because of collinearity
note: _Igrsol_60 omitted because of collinearity
note: _Igrsol_63 omitted because of collinearity
note: _Igrsol_65 omitted because of collinearity
note: _Igrsol_66 omitted because of collinearity
note: _Igrsol_67 omitted because of collinearity
note: _Igrsol_68 omitted because of collinearity
note: _Igrsol_69 omitted because of collinearity
note: _Igrsol_71 omitted because of collinearity
note: _Igrsol_72 omitted because of collinearity
note: _Igrsol_73 omitted because of collinearity
note: _Igrsol_76 omitted because of collinearity
note: _Igrsol_78 omitted because of collinearity
note: _Igrsol_79 omitted because of collinearity
note: _Igrsol_80 omitted because of collinearity
note: _Igrsol_81 omitted because of collinearity
note: _Igrsol_85 omitted because of collinearity
note: _Igrsol_86 omitted because of collinearity
note: _Igrsol_87 omitted because of collinearity
note: _Igrsol_88 omitted because of collinearity
note: _Igrsol_89 omitted because of collinearity
note: _Igrsol_90 omitted because of collinearity
note: _Igrsol_91 omitted because of collinearity
note: _Igrdatloc_4 omitted because of collinearity
note: _Igrdatloc_6 omitted because of collinearity
note: _Igrdatloc_16 omitted because of collinearity
note: _Igrdatloc_17 omitted because of collinearity
note: _Igrdatloc_18 omitted because of collinearity
note: _Igrdatloc_19 omitted because of collinearity
note: _Igrdatloc_20 omitted because of collinearity
note: _Igrdatloc_23 omitted because of collinearity
note: _Igrdatloc_24 omitted because of collinearity
note: _Igrdatloc_25 omitted because of collinearity
note: _Igrdatloc_26 omitted because of collinearity
note: _Igrdatloc_27 omitted because of collinearity
note: _Igrdatloc_28 omitted because of collinearity
note: _Igrdatloc_29 omitted because of collinearity
note: _Igrdatloc_30 omitted because of collinearity
note: _Igrdatloc_31 omitted because of collinearity
note: _Igrdatloc_32 omitted because of collinearity
note: _Igrdatloc_33 omitted because of collinearity
note: _Igrdatloc_34 omitted because of collinearity
note: _Igrdatloc_35 omitted because of collinearity
note: _Igrdatloc_36 omitted because of collinearity
note: _Igrdatloc_37 omitted because of collinearity
note: _Igrdatloc_38 omitted because of collinearity
note: _Igrdatloc_39 omitted because of collinearity
note: _Igrdatloc_40 omitted because of collinearity
note: _Igrdatloc_41 omitted because of collinearity
note: _Igrdatloc_42 omitted because of collinearity
note: _Igrdatloc_43 omitted because of collinearity
note: _Igrdatloc_44 omitted because of collinearity
note: _Igrdatloc_45 omitted because of collinearity
note: _Igrdatloc_46 omitted because of collinearity
note: _Igrdatloc_47 omitted because of collinearity
note: _Igrdatloc_48 omitted because of collinearity
note: _Igrdatloc_49 omitted because of collinearity
note: _Igrdatloc_50 omitted because of collinearity
note: _Igrdatloc_51 omitted because of collinearity
note: _Igrdatloc_52 omitted because of collinearity
note: _Igrdatloc_53 omitted because of collinearity

Linear regression                               Number of obs     =      4,962
                                                F(31, 55)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0223
                                                Root MSE          =     .24988

                                 (Std. Err. adjusted for 56 clusters in sodate)
-------------------------------------------------------------------------------
              |               Robust
      saidyes |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           dW |  -.0022597   .0079358    -0.28   0.777    -.0181634    .0136439
          dOo |  -.0176764    .014712    -1.20   0.235      -.04716    .0118072
    _Igrsol_2 |          0  (omitted)
    _Igrsol_3 |          0  (omitted)
    _Igrsol_4 |          0  (omitted)
    _Igrsol_5 |          0  (omitted)
    _Igrsol_6 |          0  (omitted)
    _Igrsol_7 |   -.068212   .0456217    -1.50   0.141    -.1596399    .0232159
    _Igrsol_8 |          0  (omitted)
    _Igrsol_9 |          0  (omitted)
   _Igrsol_10 |          0  (omitted)
   _Igrsol_11 |          0  (omitted)
   _Igrsol_12 |          0  (omitted)
   _Igrsol_13 |   .0558416    .015207     3.67   0.001     .0253661    .0863172
   _Igrsol_14 |          0  (omitted)
   _Igrsol_15 |          0  (omitted)
   _Igrsol_16 |          0  (omitted)
   _Igrsol_17 |   .0105805   .0209771     0.50   0.616    -.0314585    .0526194
   _Igrsol_18 |          0  (omitted)
   _Igrsol_19 |          0  (omitted)
   _Igrsol_20 |  -.0132316   .0441102    -0.30   0.765    -.1016304    .0751672
   _Igrsol_21 |  -.0599544   .0489215    -1.23   0.226    -.1579953    .0380864
   _Igrsol_22 |          0  (omitted)
   _Igrsol_23 |  -.0771994   .0442711    -1.74   0.087    -.1659206    .0115219
   _Igrsol_24 |          0  (omitted)
   _Igrsol_25 |          0  (omitted)
   _Igrsol_26 |          0  (omitted)
   _Igrsol_27 |   .0556877   .0152491     3.65   0.001     .0251278    .0862476
   _Igrsol_28 |          0  (omitted)
   _Igrsol_29 |  -.0729789   .0467216    -1.56   0.124     -.166611    .0206532
   _Igrsol_30 |          0  (omitted)
   _Igrsol_31 |          0  (omitted)
   _Igrsol_32 |  -.0217998   .0146741    -1.49   0.143    -.0512073    .0076077
   _Igrsol_33 |          0  (omitted)
   _Igrsol_34 |  -.0103778   .0171233    -0.61   0.547    -.0446936     .023938
   _Igrsol_35 |          0  (omitted)
   _Igrsol_36 |          0  (omitted)
   _Igrsol_37 |          0  (omitted)
   _Igrsol_38 |          0  (omitted)
   _Igrsol_39 |          0  (omitted)
   _Igrsol_40 |          0  (omitted)
   _Igrsol_41 |          0  (omitted)
   _Igrsol_42 |  -.0450288   .0115623    -3.89   0.000    -.0682001   -.0218575
   _Igrsol_43 |  -.0233897    .050574    -0.46   0.646    -.1247423    .0779629
   _Igrsol_44 |          0  (omitted)
   _Igrsol_45 |          0  (omitted)
   _Igrsol_46 |          0  (omitted)
   _Igrsol_47 |   .0060652   .0101138     0.60   0.551    -.0142033    .0263336
   _Igrsol_48 |          0  (omitted)
   _Igrsol_49 |          0  (omitted)
   _Igrsol_50 |   .0055122   .0072266     0.76   0.449    -.0089704    .0199947
   _Igrsol_51 |          0  (omitted)
   _Igrsol_52 |          0  (omitted)
   _Igrsol_53 |  -.0783215   .0522559    -1.50   0.140    -.1830446    .0264016
   _Igrsol_54 |  -.1357176   .0524108    -2.59   0.012    -.2407512    -.030684
   _Igrsol_55 |          0  (omitted)
   _Igrsol_56 |          0  (omitted)
   _Igrsol_57 |          0  (omitted)
   _Igrsol_58 |   .0143501   .0172797     0.83   0.410    -.0202792    .0489794
   _Igrsol_59 |          0  (omitted)
   _Igrsol_60 |          0  (omitted)
   _Igrsol_61 |  -.0820449     .04018    -2.04   0.046    -.1625673   -.0015224
   _Igrsol_62 |  -.0674709   .0096666    -6.98   0.000    -.0868432   -.0480986
   _Igrsol_63 |          0  (omitted)
   _Igrsol_64 |  -.0995971   .0441478    -2.26   0.028    -.1880712   -.0111229
   _Igrsol_65 |          0  (omitted)
   _Igrsol_66 |          0  (omitted)
   _Igrsol_67 |          0  (omitted)
   _Igrsol_68 |          0  (omitted)
   _Igrsol_69 |          0  (omitted)
   _Igrsol_70 |   .0341963   .0212143     1.61   0.113    -.0083181    .0767108
   _Igrsol_71 |          0  (omitted)
   _Igrsol_72 |          0  (omitted)
   _Igrsol_73 |          0  (omitted)
   _Igrsol_74 |  -.1334829   .0469088    -2.85   0.006    -.2274902   -.0394757
   _Igrsol_75 |  -.0146672   .0376283    -0.39   0.698     -.090076    .0607416
   _Igrsol_76 |          0  (omitted)
   _Igrsol_77 |  -.1274984   .0479236    -2.66   0.010    -.2235395   -.0314573
   _Igrsol_78 |          0  (omitted)
   _Igrsol_79 |          0  (omitted)
   _Igrsol_80 |          0  (omitted)
   _Igrsol_81 |          0  (omitted)
   _Igrsol_82 |    -.00684    .023071    -0.30   0.768    -.0530752    .0393952
   _Igrsol_83 |  -.0829861   .0521468    -1.59   0.117    -.1874906    .0215184
   _Igrsol_84 |  -.1031848   .0426984    -2.42   0.019    -.1887544   -.0176153
   _Igrsol_85 |          0  (omitted)
   _Igrsol_86 |          0  (omitted)
   _Igrsol_87 |          0  (omitted)
   _Igrsol_88 |          0  (omitted)
   _Igrsol_89 |          0  (omitted)
   _Igrsol_90 |          0  (omitted)
   _Igrsol_91 |          0  (omitted)
   _Igrsol_92 |  -.0627382   .0422472    -1.49   0.143    -.1474036    .0219271
 _Igrdatloc_2 |   .0116754    .018957     0.62   0.541    -.0263154    .0496661
 _Igrdatloc_3 |   .0333421   .0119774     2.78   0.007     .0093388    .0573454
 _Igrdatloc_4 |          0  (omitted)
 _Igrdatloc_5 |   .0559797   .0276641     2.02   0.048     .0005397    .1114198
 _Igrdatloc_6 |          0  (omitted)
 _Igrdatloc_7 |    .067278    .042057     1.60   0.115    -.0170062    .1515622
 _Igrdatloc_8 |   .0643468   .0457593     1.41   0.165    -.0273569    .1560505
 _Igrdatloc_9 |    .026619   .0424721     0.63   0.533     -.058497    .1117349
_Igrdatloc_10 |   .0385097   .0425977     0.90   0.370     -.046858    .1238775
_Igrdatloc_11 |    .010503   .0438604     0.24   0.812    -.0773952    .0984012
_Igrdatloc_12 |   .0437013   .0453402     0.96   0.339    -.0471625     .134565
_Igrdatloc_13 |   .0007378   .0375672     0.02   0.984    -.0745487    .0760242
_Igrdatloc_14 |   .0010265   .0353659     0.03   0.977    -.0698485    .0719014
_Igrdatloc_15 |   .0414349   .0448333     0.92   0.359     -.048413    .1312828
_Igrdatloc_16 |          0  (omitted)
_Igrdatloc_17 |          0  (omitted)
_Igrdatloc_18 |          0  (omitted)
_Igrdatloc_19 |          0  (omitted)
_Igrdatloc_20 |          0  (omitted)
_Igrdatloc_21 |   .0186747   .0369404     0.51   0.615    -.0553554    .0927049
_Igrdatloc_22 |   .0141618   .0327967     0.43   0.668    -.0515643    .0798879
_Igrdatloc_23 |          0  (omitted)
_Igrdatloc_24 |          0  (omitted)
_Igrdatloc_25 |          0  (omitted)
_Igrdatloc_26 |          0  (omitted)
_Igrdatloc_27 |          0  (omitted)
_Igrdatloc_28 |          0  (omitted)
_Igrdatloc_29 |          0  (omitted)
_Igrdatloc_30 |          0  (omitted)
_Igrdatloc_31 |          0  (omitted)
_Igrdatloc_32 |          0  (omitted)
_Igrdatloc_33 |          0  (omitted)
_Igrdatloc_34 |          0  (omitted)
_Igrdatloc_35 |          0  (omitted)
_Igrdatloc_36 |          0  (omitted)
_Igrdatloc_37 |          0  (omitted)
_Igrdatloc_38 |          0  (omitted)
_Igrdatloc_39 |          0  (omitted)
_Igrdatloc_40 |          0  (omitted)
_Igrdatloc_41 |          0  (omitted)
_Igrdatloc_42 |          0  (omitted)
_Igrdatloc_43 |          0  (omitted)
_Igrdatloc_44 |          0  (omitted)
_Igrdatloc_45 |          0  (omitted)
_Igrdatloc_46 |          0  (omitted)
_Igrdatloc_47 |          0  (omitted)
_Igrdatloc_48 |          0  (omitted)
_Igrdatloc_49 |          0  (omitted)
_Igrdatloc_50 |          0  (omitted)
_Igrdatloc_51 |          0  (omitted)
_Igrdatloc_52 |          0  (omitted)
_Igrdatloc_53 |          0  (omitted)
   _Igrhour_2 |  -.0156033   .0154501    -1.01   0.317    -.0465659    .0153594
   _Igrhour_3 |   -.005671   .0146069    -0.39   0.699    -.0349439    .0236019
   _Igrhour_4 |  -.0328157   .0118079    -2.78   0.007    -.0564793    -.009152
   _Igrhour_5 |  -.0175479   .0168775    -1.04   0.303    -.0513711    .0162753
   _Igrhour_6 |  -.0105454   .0146205    -0.72   0.474    -.0398455    .0187547
   _Igrarea_2 |  -.0591019   .0307657    -1.92   0.060    -.1207578     .002554
   _Igrarea_3 |  -.0370412   .0269838    -1.37   0.175    -.0911179    .0170355
   _Igrarea_4 |  -.0190407   .0241262    -0.79   0.433    -.0673907    .0293094
   _Igrarea_5 |  -.0113263   .0189381    -0.60   0.552    -.0492792    .0266266
   _Igrarea_6 |  -.0269175   .0176148    -1.53   0.132    -.0622184    .0083834
   _Igrarea_7 |  -.0107413   .0187022    -0.57   0.568    -.0482213    .0267386
   _Igrarea_8 |   .0066653   .0143978     0.46   0.645    -.0221886    .0355192
        _cons |   .1210301   .0224452     5.39   0.000     .0760488    .1660114
-------------------------------------------------------------------------------
(option xb assumed; fitted values)
(14,606 missing values generated)
  coeff_b1 = -.00225973
  coeff_b2 =  -.0176764
(14,606 missing values generated)
(14,606 missing values generated)
(14,606 missing values generated)
(14,739 real changes made)
(14,739 real changes made)
(14,942 real changes made)

Mean estimation                   Number of obs   =      4,962

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     yhat_Nw |   .0706978   .0005361      .0696468    .0717488
     ahat_Nw |   .4045399   .0009727      .4026329    .4064468
       lb_Nw |   .0706978   .0005361      .0696468    .0717488
       ub_Nw |   .6661579   .0008591      .6644737    .6678421
--------------------------------------------------------------

Mean estimation                   Number of obs   =      4,962

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
      yhat_W |   .0684986   .0005345      .0674507    .0695465
      ahat_W |   .3642298   .0009727      .3623228    .3661368
        lb_W |   .0684986   .0005345      .0674507    .0695465
        ub_W |   .7042688   .0008593      .7025843    .7059533
--------------------------------------------------------------

Mean estimation                   Number of obs   =      4,962

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     yhat_Oo |   .0537945   .0005181      .0527788    .0548101
     ahat_Oo |   .3044857   .0009727      .3025787    .3063926
       lb_Oo |   .0537945   .0005181      .0527788    .0548101
       ub_Oo |   .7493088   .0008617      .7476195     .750998
--------------------------------------------------------------
i.grsol           _Igrsol_1-92        (naturally coded; _Igrsol_1 omitted)
i.grdatloc        _Igrdatloc_1-53     (naturally coded; _Igrdatloc_1 omitted)
i.grhour          _Igrhour_1-6        (naturally coded; _Igrhour_1 omitted)
i.grarea          _Igrarea_1-8        (naturally coded; _Igrarea_1 omitted)
note: _Igrsol_2 omitted because of collinearity
note: _Igrsol_3 omitted because of collinearity
note: _Igrsol_5 omitted because of collinearity
note: _Igrsol_6 omitted because of collinearity
note: _Igrsol_7 omitted because of collinearity
note: _Igrsol_8 omitted because of collinearity
note: _Igrsol_9 omitted because of collinearity
note: _Igrsol_10 omitted because of collinearity
note: _Igrsol_12 omitted because of collinearity
note: _Igrsol_13 omitted because of collinearity
note: _Igrsol_14 omitted because of collinearity
note: _Igrsol_15 omitted because of collinearity
note: _Igrsol_16 omitted because of collinearity
note: _Igrsol_17 omitted because of collinearity
note: _Igrsol_19 omitted because of collinearity
note: _Igrsol_20 omitted because of collinearity
note: _Igrsol_21 omitted because of collinearity
note: _Igrsol_22 omitted because of collinearity
note: _Igrsol_23 omitted because of collinearity
note: _Igrsol_24 omitted because of collinearity
note: _Igrsol_25 omitted because of collinearity
note: _Igrsol_26 omitted because of collinearity
note: _Igrsol_27 omitted because of collinearity
note: _Igrsol_29 omitted because of collinearity
note: _Igrsol_31 omitted because of collinearity
note: _Igrsol_32 omitted because of collinearity
note: _Igrsol_35 omitted because of collinearity
note: _Igrsol_36 omitted because of collinearity
note: _Igrsol_37 omitted because of collinearity
note: _Igrsol_38 omitted because of collinearity
note: _Igrsol_39 omitted because of collinearity
note: _Igrsol_40 omitted because of collinearity
note: _Igrsol_41 omitted because of collinearity
note: _Igrsol_42 omitted because of collinearity
note: _Igrsol_43 omitted because of collinearity
note: _Igrsol_44 omitted because of collinearity
note: _Igrsol_45 omitted because of collinearity
note: _Igrsol_49 omitted because of collinearity
note: _Igrsol_50 omitted because of collinearity
note: _Igrsol_51 omitted because of collinearity
note: _Igrsol_52 omitted because of collinearity
note: _Igrsol_53 omitted because of collinearity
note: _Igrsol_54 omitted because of collinearity
note: _Igrsol_55 omitted because of collinearity
note: _Igrsol_56 omitted because of collinearity
note: _Igrsol_57 omitted because of collinearity
note: _Igrsol_59 omitted because of collinearity
note: _Igrsol_60 omitted because of collinearity
note: _Igrsol_63 omitted because of collinearity
note: _Igrsol_64 omitted because of collinearity
note: _Igrsol_65 omitted because of collinearity
note: _Igrsol_66 omitted because of collinearity
note: _Igrsol_67 omitted because of collinearity
note: _Igrsol_68 omitted because of collinearity
note: _Igrsol_69 omitted because of collinearity
note: _Igrsol_70 omitted because of collinearity
note: _Igrsol_71 omitted because of collinearity
note: _Igrsol_72 omitted because of collinearity
note: _Igrsol_73 omitted because of collinearity
note: _Igrsol_74 omitted because of collinearity
note: _Igrsol_77 omitted because of collinearity
note: _Igrsol_78 omitted because of collinearity
note: _Igrsol_79 omitted because of collinearity
note: _Igrsol_80 omitted because of collinearity
note: _Igrsol_81 omitted because of collinearity
note: _Igrsol_83 omitted because of collinearity
note: _Igrsol_84 omitted because of collinearity
note: _Igrsol_85 omitted because of collinearity
note: _Igrsol_86 omitted because of collinearity
note: _Igrsol_87 omitted because of collinearity
note: _Igrsol_88 omitted because of collinearity
note: _Igrsol_89 omitted because of collinearity
note: _Igrsol_90 omitted because of collinearity
note: _Igrsol_91 omitted because of collinearity
note: _Igrsol_92 omitted because of collinearity
note: _Igrdatloc_2 omitted because of collinearity
note: _Igrdatloc_7 omitted because of collinearity
note: _Igrdatloc_9 omitted because of collinearity
note: _Igrdatloc_10 omitted because of collinearity
note: _Igrdatloc_11 omitted because of collinearity
note: _Igrdatloc_12 omitted because of collinearity
note: _Igrdatloc_13 omitted because of collinearity
note: _Igrdatloc_14 omitted because of collinearity
note: _Igrdatloc_15 omitted because of collinearity
note: _Igrdatloc_17 omitted because of collinearity
note: _Igrdatloc_19 omitted because of collinearity
note: _Igrdatloc_20 omitted because of collinearity
note: _Igrdatloc_22 omitted because of collinearity
note: _Igrdatloc_23 omitted because of collinearity
note: _Igrdatloc_24 omitted because of collinearity
note: _Igrdatloc_25 omitted because of collinearity
note: _Igrdatloc_26 omitted because of collinearity
note: _Igrdatloc_27 omitted because of collinearity
note: _Igrdatloc_28 omitted because of collinearity
note: _Igrdatloc_29 omitted because of collinearity
note: _Igrdatloc_30 omitted because of collinearity
note: _Igrdatloc_31 omitted because of collinearity
note: _Igrdatloc_32 omitted because of collinearity
note: _Igrdatloc_33 omitted because of collinearity
note: _Igrdatloc_34 omitted because of collinearity
note: _Igrdatloc_35 omitted because of collinearity
note: _Igrdatloc_36 omitted because of collinearity
note: _Igrdatloc_37 omitted because of collinearity
note: _Igrdatloc_38 omitted because of collinearity
note: _Igrdatloc_39 omitted because of collinearity
note: _Igrdatloc_40 omitted because of collinearity
note: _Igrdatloc_41 omitted because of collinearity
note: _Igrdatloc_42 omitted because of collinearity
note: _Igrdatloc_43 omitted because of collinearity
note: _Igrdatloc_44 omitted because of collinearity
note: _Igrdatloc_45 omitted because of collinearity
note: _Igrdatloc_46 omitted because of collinearity
note: _Igrdatloc_47 omitted because of collinearity
note: _Igrdatloc_48 omitted because of collinearity
note: _Igrdatloc_49 omitted because of collinearity
note: _Igrdatloc_50 omitted because of collinearity
note: _Igrdatloc_51 omitted because of collinearity
note: _Igrdatloc_52 omitted because of collinearity
note: _Igrdatloc_53 omitted because of collinearity

Linear regression                               Number of obs     =      2,706
                                                F(20, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0286
                                                Root MSE          =     .48573

                                 (Std. Err. adjusted for 28 clusters in sodate)
-------------------------------------------------------------------------------
              |               Robust
       answer |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           dW |  -.0338103   .0320612    -1.05   0.301    -.0995944    .0319737
          dOo |  -.0863561   .0275988    -3.13   0.004    -.1429841   -.0297281
    _Igrsol_2 |          0  (omitted)
    _Igrsol_3 |          0  (omitted)
    _Igrsol_4 |  -.1320262   .0730542    -1.81   0.082     -.281921    .0178686
    _Igrsol_5 |          0  (omitted)
    _Igrsol_6 |          0  (omitted)
    _Igrsol_7 |          0  (omitted)
    _Igrsol_8 |          0  (omitted)
    _Igrsol_9 |          0  (omitted)
   _Igrsol_10 |          0  (omitted)
   _Igrsol_11 |   -.134932   .0686137    -1.97   0.060    -.2757158    .0058518
   _Igrsol_12 |          0  (omitted)
   _Igrsol_13 |          0  (omitted)
   _Igrsol_14 |          0  (omitted)
   _Igrsol_15 |          0  (omitted)
   _Igrsol_16 |          0  (omitted)
   _Igrsol_17 |          0  (omitted)
   _Igrsol_18 |  -.1498835   .0621757    -2.41   0.023    -.2774575   -.0223096
   _Igrsol_19 |          0  (omitted)
   _Igrsol_20 |          0  (omitted)
   _Igrsol_21 |          0  (omitted)
   _Igrsol_22 |          0  (omitted)
   _Igrsol_23 |          0  (omitted)
   _Igrsol_24 |          0  (omitted)
   _Igrsol_25 |          0  (omitted)
   _Igrsol_26 |          0  (omitted)
   _Igrsol_27 |          0  (omitted)
   _Igrsol_28 |  -.0103222   .0759954    -0.14   0.893     -.166252    .1456076
   _Igrsol_29 |          0  (omitted)
   _Igrsol_30 |  -.2008492   .0656691    -3.06   0.005    -.3355912   -.0661073
   _Igrsol_31 |          0  (omitted)
   _Igrsol_32 |          0  (omitted)
   _Igrsol_33 |  -.0663421   .0436253    -1.52   0.140    -.1558538    .0231696
   _Igrsol_34 |  -.1441653   .0831856    -1.73   0.094    -.3148481    .0265175
   _Igrsol_35 |          0  (omitted)
   _Igrsol_36 |          0  (omitted)
   _Igrsol_37 |          0  (omitted)
   _Igrsol_38 |          0  (omitted)
   _Igrsol_39 |          0  (omitted)
   _Igrsol_40 |          0  (omitted)
   _Igrsol_41 |          0  (omitted)
   _Igrsol_42 |          0  (omitted)
   _Igrsol_43 |          0  (omitted)
   _Igrsol_44 |          0  (omitted)
   _Igrsol_45 |          0  (omitted)
   _Igrsol_46 |  -.2243511   .0740164    -3.03   0.005    -.3762203   -.0724819
   _Igrsol_47 |  -.0518795   .0778275    -0.67   0.511    -.2115683    .1078093
   _Igrsol_48 |  -.1325109   .0713277    -1.86   0.074    -.2788632    .0138413
   _Igrsol_49 |          0  (omitted)
   _Igrsol_50 |          0  (omitted)
   _Igrsol_51 |          0  (omitted)
   _Igrsol_52 |          0  (omitted)
   _Igrsol_53 |          0  (omitted)
   _Igrsol_54 |          0  (omitted)
   _Igrsol_55 |          0  (omitted)
   _Igrsol_56 |          0  (omitted)
   _Igrsol_57 |          0  (omitted)
   _Igrsol_58 |  -.1632515   .0650794    -2.51   0.018    -.2967835   -.0297195
   _Igrsol_59 |          0  (omitted)
   _Igrsol_60 |          0  (omitted)
   _Igrsol_61 |  -.1811925   .0541957    -3.34   0.002    -.2923929   -.0699922
   _Igrsol_62 |  -.1743966   .0723966    -2.41   0.023    -.3229421   -.0258512
   _Igrsol_63 |          0  (omitted)
   _Igrsol_64 |          0  (omitted)
   _Igrsol_65 |          0  (omitted)
   _Igrsol_66 |          0  (omitted)
   _Igrsol_67 |          0  (omitted)
   _Igrsol_68 |          0  (omitted)
   _Igrsol_69 |          0  (omitted)
   _Igrsol_70 |          0  (omitted)
   _Igrsol_71 |          0  (omitted)
   _Igrsol_72 |          0  (omitted)
   _Igrsol_73 |          0  (omitted)
   _Igrsol_74 |          0  (omitted)
   _Igrsol_75 |  -.1322491   .0541399    -2.44   0.021     -.243335   -.0211633
   _Igrsol_76 |  -.1942582   .0594949    -3.27   0.003    -.3163316   -.0721847
   _Igrsol_77 |          0  (omitted)
   _Igrsol_78 |          0  (omitted)
   _Igrsol_79 |          0  (omitted)
   _Igrsol_80 |          0  (omitted)
   _Igrsol_81 |          0  (omitted)
   _Igrsol_82 |  -.1139509   .0501263    -2.27   0.031    -.2168015   -.0111002
   _Igrsol_83 |          0  (omitted)
   _Igrsol_84 |          0  (omitted)
   _Igrsol_85 |          0  (omitted)
   _Igrsol_86 |          0  (omitted)
   _Igrsol_87 |          0  (omitted)
   _Igrsol_88 |          0  (omitted)
   _Igrsol_89 |          0  (omitted)
   _Igrsol_90 |          0  (omitted)
   _Igrsol_91 |          0  (omitted)
   _Igrsol_92 |          0  (omitted)
 _Igrdatloc_2 |          0  (omitted)
 _Igrdatloc_3 |  -.0192456   .0172586    -1.12   0.275    -.0546574    .0161662
 _Igrdatloc_4 |  -.0688563   .0268359    -2.57   0.016    -.1239189   -.0137936
 _Igrdatloc_5 |  -.0502672   .0387064    -1.30   0.205    -.1296861    .0291516
 _Igrdatloc_6 |   .1068868   .0162081     6.59   0.000     .0736305     .140143
 _Igrdatloc_7 |          0  (omitted)
 _Igrdatloc_8 |  -.1087128   .0334666    -3.25   0.003    -.1773805   -.0400451
 _Igrdatloc_9 |          0  (omitted)
_Igrdatloc_10 |          0  (omitted)
_Igrdatloc_11 |          0  (omitted)
_Igrdatloc_12 |          0  (omitted)
_Igrdatloc_13 |          0  (omitted)
_Igrdatloc_14 |          0  (omitted)
_Igrdatloc_15 |          0  (omitted)
_Igrdatloc_16 |  -.0409786     .03596    -1.14   0.264    -.1147625    .0328053
_Igrdatloc_17 |          0  (omitted)
_Igrdatloc_18 |   .0141982   .0538088     0.26   0.794    -.0962082    .1246047
_Igrdatloc_19 |          0  (omitted)
_Igrdatloc_20 |          0  (omitted)
_Igrdatloc_21 |   .1018968   .0430191     2.37   0.025     .0136288    .1901648
_Igrdatloc_22 |          0  (omitted)
_Igrdatloc_23 |          0  (omitted)
_Igrdatloc_24 |          0  (omitted)
_Igrdatloc_25 |          0  (omitted)
_Igrdatloc_26 |          0  (omitted)
_Igrdatloc_27 |          0  (omitted)
_Igrdatloc_28 |          0  (omitted)
_Igrdatloc_29 |          0  (omitted)
_Igrdatloc_30 |          0  (omitted)
_Igrdatloc_31 |          0  (omitted)
_Igrdatloc_32 |          0  (omitted)
_Igrdatloc_33 |          0  (omitted)
_Igrdatloc_34 |          0  (omitted)
_Igrdatloc_35 |          0  (omitted)
_Igrdatloc_36 |          0  (omitted)
_Igrdatloc_37 |          0  (omitted)
_Igrdatloc_38 |          0  (omitted)
_Igrdatloc_39 |          0  (omitted)
_Igrdatloc_40 |          0  (omitted)
_Igrdatloc_41 |          0  (omitted)
_Igrdatloc_42 |          0  (omitted)
_Igrdatloc_43 |          0  (omitted)
_Igrdatloc_44 |          0  (omitted)
_Igrdatloc_45 |          0  (omitted)
_Igrdatloc_46 |          0  (omitted)
_Igrdatloc_47 |          0  (omitted)
_Igrdatloc_48 |          0  (omitted)
_Igrdatloc_49 |          0  (omitted)
_Igrdatloc_50 |          0  (omitted)
_Igrdatloc_51 |          0  (omitted)
_Igrdatloc_52 |          0  (omitted)
_Igrdatloc_53 |          0  (omitted)
   _Igrhour_2 |   .0618348   .0444551     1.39   0.176    -.0293796    .1530492
   _Igrhour_3 |   .0274692   .0401677     0.68   0.500     -.054948    .1098865
   _Igrhour_4 |   .0572985   .0376651     1.52   0.140    -.0199839    .1345809
   _Igrhour_5 |   .0307241   .0407745     0.75   0.458    -.0529382    .1143864
   _Igrhour_6 |   .0433408   .0406967     1.06   0.296    -.0401619    .1268435
   _Igrarea_2 |   .0888091   .0973335     0.91   0.370    -.1109027     .288521
   _Igrarea_3 |   .0581727   .0740383     0.79   0.439    -.0937414    .2100868
   _Igrarea_4 |   .0755785   .0618651     1.22   0.232    -.0513581    .2025151
   _Igrarea_5 |   .0764176   .0450258     1.70   0.101    -.0159678    .1688029
   _Igrarea_6 |   .1236221   .0486305     2.54   0.017     .0238407    .2234036
   _Igrarea_7 |   .0935844   .0549914     1.70   0.100    -.0192486    .2064173
   _Igrarea_8 |   .0619411   .0849686     0.73   0.472    -.1124001    .2362823
        _cons |   .4391026   .0534392     8.22   0.000     .3294543    .5487509
-------------------------------------------------------------------------------
(option xb assumed; fitted values)
(16,862 missing values generated)
  coeff_b1 = -.03381034
  coeff_b2 = -.08635608
(16,862 missing values generated)
(16,862 missing values generated)
(16,862 missing values generated)
(16,862 real changes made)
(16,862 real changes made)
(16,862 real changes made)
i.grsol           _Igrsol_1-92        (naturally coded; _Igrsol_1 omitted)
i.grdatloc        _Igrdatloc_1-53     (naturally coded; _Igrdatloc_1 omitted)
i.grhour          _Igrhour_1-6        (naturally coded; _Igrhour_1 omitted)
i.grarea          _Igrarea_1-8        (naturally coded; _Igrarea_1 omitted)
note: _Igrsol_2 omitted because of collinearity
note: _Igrsol_3 omitted because of collinearity
note: _Igrsol_5 omitted because of collinearity
note: _Igrsol_6 omitted because of collinearity
note: _Igrsol_7 omitted because of collinearity
note: _Igrsol_8 omitted because of collinearity
note: _Igrsol_9 omitted because of collinearity
note: _Igrsol_10 omitted because of collinearity
note: _Igrsol_12 omitted because of collinearity
note: _Igrsol_13 omitted because of collinearity
note: _Igrsol_14 omitted because of collinearity
note: _Igrsol_15 omitted because of collinearity
note: _Igrsol_16 omitted because of collinearity
note: _Igrsol_17 omitted because of collinearity
note: _Igrsol_19 omitted because of collinearity
note: _Igrsol_20 omitted because of collinearity
note: _Igrsol_21 omitted because of collinearity
note: _Igrsol_22 omitted because of collinearity
note: _Igrsol_23 omitted because of collinearity
note: _Igrsol_24 omitted because of collinearity
note: _Igrsol_25 omitted because of collinearity
note: _Igrsol_26 omitted because of collinearity
note: _Igrsol_27 omitted because of collinearity
note: _Igrsol_29 omitted because of collinearity
note: _Igrsol_31 omitted because of collinearity
note: _Igrsol_32 omitted because of collinearity
note: _Igrsol_35 omitted because of collinearity
note: _Igrsol_36 omitted because of collinearity
note: _Igrsol_37 omitted because of collinearity
note: _Igrsol_38 omitted because of collinearity
note: _Igrsol_39 omitted because of collinearity
note: _Igrsol_40 omitted because of collinearity
note: _Igrsol_41 omitted because of collinearity
note: _Igrsol_42 omitted because of collinearity
note: _Igrsol_43 omitted because of collinearity
note: _Igrsol_44 omitted because of collinearity
note: _Igrsol_45 omitted because of collinearity
note: _Igrsol_49 omitted because of collinearity
note: _Igrsol_50 omitted because of collinearity
note: _Igrsol_51 omitted because of collinearity
note: _Igrsol_52 omitted because of collinearity
note: _Igrsol_53 omitted because of collinearity
note: _Igrsol_54 omitted because of collinearity
note: _Igrsol_55 omitted because of collinearity
note: _Igrsol_56 omitted because of collinearity
note: _Igrsol_57 omitted because of collinearity
note: _Igrsol_59 omitted because of collinearity
note: _Igrsol_60 omitted because of collinearity
note: _Igrsol_63 omitted because of collinearity
note: _Igrsol_64 omitted because of collinearity
note: _Igrsol_65 omitted because of collinearity
note: _Igrsol_66 omitted because of collinearity
note: _Igrsol_67 omitted because of collinearity
note: _Igrsol_68 omitted because of collinearity
note: _Igrsol_69 omitted because of collinearity
note: _Igrsol_70 omitted because of collinearity
note: _Igrsol_71 omitted because of collinearity
note: _Igrsol_72 omitted because of collinearity
note: _Igrsol_73 omitted because of collinearity
note: _Igrsol_74 omitted because of collinearity
note: _Igrsol_77 omitted because of collinearity
note: _Igrsol_78 omitted because of collinearity
note: _Igrsol_79 omitted because of collinearity
note: _Igrsol_80 omitted because of collinearity
note: _Igrsol_81 omitted because of collinearity
note: _Igrsol_83 omitted because of collinearity
note: _Igrsol_84 omitted because of collinearity
note: _Igrsol_85 omitted because of collinearity
note: _Igrsol_86 omitted because of collinearity
note: _Igrsol_87 omitted because of collinearity
note: _Igrsol_88 omitted because of collinearity
note: _Igrsol_89 omitted because of collinearity
note: _Igrsol_90 omitted because of collinearity
note: _Igrsol_91 omitted because of collinearity
note: _Igrsol_92 omitted because of collinearity
note: _Igrdatloc_2 omitted because of collinearity
note: _Igrdatloc_7 omitted because of collinearity
note: _Igrdatloc_9 omitted because of collinearity
note: _Igrdatloc_10 omitted because of collinearity
note: _Igrdatloc_11 omitted because of collinearity
note: _Igrdatloc_12 omitted because of collinearity
note: _Igrdatloc_13 omitted because of collinearity
note: _Igrdatloc_14 omitted because of collinearity
note: _Igrdatloc_15 omitted because of collinearity
note: _Igrdatloc_17 omitted because of collinearity
note: _Igrdatloc_19 omitted because of collinearity
note: _Igrdatloc_20 omitted because of collinearity
note: _Igrdatloc_22 omitted because of collinearity
note: _Igrdatloc_23 omitted because of collinearity
note: _Igrdatloc_24 omitted because of collinearity
note: _Igrdatloc_25 omitted because of collinearity
note: _Igrdatloc_26 omitted because of collinearity
note: _Igrdatloc_27 omitted because of collinearity
note: _Igrdatloc_28 omitted because of collinearity
note: _Igrdatloc_29 omitted because of collinearity
note: _Igrdatloc_30 omitted because of collinearity
note: _Igrdatloc_31 omitted because of collinearity
note: _Igrdatloc_32 omitted because of collinearity
note: _Igrdatloc_33 omitted because of collinearity
note: _Igrdatloc_34 omitted because of collinearity
note: _Igrdatloc_35 omitted because of collinearity
note: _Igrdatloc_36 omitted because of collinearity
note: _Igrdatloc_37 omitted because of collinearity
note: _Igrdatloc_38 omitted because of collinearity
note: _Igrdatloc_39 omitted because of collinearity
note: _Igrdatloc_40 omitted because of collinearity
note: _Igrdatloc_41 omitted because of collinearity
note: _Igrdatloc_42 omitted because of collinearity
note: _Igrdatloc_43 omitted because of collinearity
note: _Igrdatloc_44 omitted because of collinearity
note: _Igrdatloc_45 omitted because of collinearity
note: _Igrdatloc_46 omitted because of collinearity
note: _Igrdatloc_47 omitted because of collinearity
note: _Igrdatloc_48 omitted because of collinearity
note: _Igrdatloc_49 omitted because of collinearity
note: _Igrdatloc_50 omitted because of collinearity
note: _Igrdatloc_51 omitted because of collinearity
note: _Igrdatloc_52 omitted because of collinearity
note: _Igrdatloc_53 omitted because of collinearity

Linear regression                               Number of obs     =      2,706
                                                F(20, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0243
                                                Root MSE          =     .20401

                                 (Std. Err. adjusted for 28 clusters in sodate)
-------------------------------------------------------------------------------
              |               Robust
      saidyes |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
           dW |   .0043962   .0080072     0.55   0.588    -.0120333    .0208257
          dOo |  -.0197305   .0098655    -2.00   0.056    -.0399729    .0005119
    _Igrsol_2 |          0  (omitted)
    _Igrsol_3 |          0  (omitted)
    _Igrsol_4 |   -.042999   .0141749    -3.03   0.005    -.0720836   -.0139145
    _Igrsol_5 |          0  (omitted)
    _Igrsol_6 |          0  (omitted)
    _Igrsol_7 |          0  (omitted)
    _Igrsol_8 |          0  (omitted)
    _Igrsol_9 |          0  (omitted)
   _Igrsol_10 |          0  (omitted)
   _Igrsol_11 |   -.034767   .0113142    -3.07   0.005    -.0579818   -.0115523
   _Igrsol_12 |          0  (omitted)
   _Igrsol_13 |          0  (omitted)
   _Igrsol_14 |          0  (omitted)
   _Igrsol_15 |          0  (omitted)
   _Igrsol_16 |          0  (omitted)
   _Igrsol_17 |          0  (omitted)
   _Igrsol_18 |   .0285075   .0144013     1.98   0.058    -.0010416    .0580566
   _Igrsol_19 |          0  (omitted)
   _Igrsol_20 |          0  (omitted)
   _Igrsol_21 |          0  (omitted)
   _Igrsol_22 |          0  (omitted)
   _Igrsol_23 |          0  (omitted)
   _Igrsol_24 |          0  (omitted)
   _Igrsol_25 |          0  (omitted)
   _Igrsol_26 |          0  (omitted)
   _Igrsol_27 |          0  (omitted)
   _Igrsol_28 |  -.0493449   .0155012    -3.18   0.004    -.0811508   -.0175391
   _Igrsol_29 |          0  (omitted)
   _Igrsol_30 |   .0254146   .0114943     2.21   0.036     .0018304    .0489989
   _Igrsol_31 |          0  (omitted)
   _Igrsol_32 |          0  (omitted)
   _Igrsol_33 |  -.0344765   .0082778    -4.16   0.000    -.0514611   -.0174918
   _Igrsol_34 |  -.0154582   .0204864    -0.75   0.457    -.0574929    .0265764
   _Igrsol_35 |          0  (omitted)
   _Igrsol_36 |          0  (omitted)
   _Igrsol_37 |          0  (omitted)
   _Igrsol_38 |          0  (omitted)
   _Igrsol_39 |          0  (omitted)
   _Igrsol_40 |          0  (omitted)
   _Igrsol_41 |          0  (omitted)
   _Igrsol_42 |          0  (omitted)
   _Igrsol_43 |          0  (omitted)
   _Igrsol_44 |          0  (omitted)
   _Igrsol_45 |          0  (omitted)
   _Igrsol_46 |  -.0453038   .0104418    -4.34   0.000    -.0667286    -.023879
   _Igrsol_47 |   .0035169   .0209174     0.17   0.868    -.0394021    .0464359
   _Igrsol_48 |  -.0353761   .0109688    -3.23   0.003    -.0578822     -.01287
   _Igrsol_49 |          0  (omitted)
   _Igrsol_50 |          0  (omitted)
   _Igrsol_51 |          0  (omitted)
   _Igrsol_52 |          0  (omitted)
   _Igrsol_53 |          0  (omitted)
   _Igrsol_54 |          0  (omitted)
   _Igrsol_55 |          0  (omitted)
   _Igrsol_56 |          0  (omitted)
   _Igrsol_57 |          0  (omitted)
   _Igrsol_58 |   .0082801   .0125057     0.66   0.514    -.0173795    .0339397
   _Igrsol_59 |          0  (omitted)
   _Igrsol_60 |          0  (omitted)
   _Igrsol_61 |  -.0575462   .0105016    -5.48   0.000    -.0790938   -.0359987
   _Igrsol_62 |  -.0494895    .013501    -3.67   0.001    -.0771912   -.0217878
   _Igrsol_63 |          0  (omitted)
   _Igrsol_64 |          0  (omitted)
   _Igrsol_65 |          0  (omitted)
   _Igrsol_66 |          0  (omitted)
   _Igrsol_67 |          0  (omitted)
   _Igrsol_68 |          0  (omitted)
   _Igrsol_69 |          0  (omitted)
   _Igrsol_70 |          0  (omitted)
   _Igrsol_71 |          0  (omitted)
   _Igrsol_72 |          0  (omitted)
   _Igrsol_73 |          0  (omitted)
   _Igrsol_74 |          0  (omitted)
   _Igrsol_75 |  -.0415846   .0128717    -3.23   0.003    -.0679951   -.0151741
   _Igrsol_76 |    -.03342   .0099492    -3.36   0.002    -.0538341   -.0130059
   _Igrsol_77 |          0  (omitted)
   _Igrsol_78 |          0  (omitted)
   _Igrsol_79 |          0  (omitted)
   _Igrsol_80 |          0  (omitted)
   _Igrsol_81 |          0  (omitted)
   _Igrsol_82 |  -.0365752   .0107095    -3.42   0.002    -.0585493   -.0146012
   _Igrsol_83 |          0  (omitted)
   _Igrsol_84 |          0  (omitted)
   _Igrsol_85 |          0  (omitted)
   _Igrsol_86 |          0  (omitted)
   _Igrsol_87 |          0  (omitted)
   _Igrsol_88 |          0  (omitted)
   _Igrsol_89 |          0  (omitted)
   _Igrsol_90 |          0  (omitted)
   _Igrsol_91 |          0  (omitted)
   _Igrsol_92 |          0  (omitted)
 _Igrdatloc_2 |          0  (omitted)
 _Igrdatloc_3 |   .0138964   .0055928     2.48   0.019      .002421    .0253719
 _Igrdatloc_4 |   .0659988   .0063042    10.47   0.000     .0530637    .0789339
 _Igrdatloc_5 |   .0224278   .0090032     2.49   0.019     .0039548    .0409007
 _Igrdatloc_6 |    .040539    .005402     7.50   0.000     .0294551    .0516229
 _Igrdatloc_7 |          0  (omitted)
 _Igrdatloc_8 |  -.0418744    .009449    -4.43   0.000    -.0612622   -.0224866
 _Igrdatloc_9 |          0  (omitted)
_Igrdatloc_10 |          0  (omitted)
_Igrdatloc_11 |          0  (omitted)
_Igrdatloc_12 |          0  (omitted)
_Igrdatloc_13 |          0  (omitted)
_Igrdatloc_14 |          0  (omitted)
_Igrdatloc_15 |          0  (omitted)
_Igrdatloc_16 |   .0306746   .0081218     3.78   0.001       .01401    .0473391
_Igrdatloc_17 |          0  (omitted)
_Igrdatloc_18 |  -.0201176   .0115541    -1.74   0.093    -.0438247    .0035895
_Igrdatloc_19 |          0  (omitted)
_Igrdatloc_20 |          0  (omitted)
_Igrdatloc_21 |   .0093275   .0063391     1.47   0.153    -.0036793    .0223343
_Igrdatloc_22 |          0  (omitted)
_Igrdatloc_23 |          0  (omitted)
_Igrdatloc_24 |          0  (omitted)
_Igrdatloc_25 |          0  (omitted)
_Igrdatloc_26 |          0  (omitted)
_Igrdatloc_27 |          0  (omitted)
_Igrdatloc_28 |          0  (omitted)
_Igrdatloc_29 |          0  (omitted)
_Igrdatloc_30 |          0  (omitted)
_Igrdatloc_31 |          0  (omitted)
_Igrdatloc_32 |          0  (omitted)
_Igrdatloc_33 |          0  (omitted)
_Igrdatloc_34 |          0  (omitted)
_Igrdatloc_35 |          0  (omitted)
_Igrdatloc_36 |          0  (omitted)
_Igrdatloc_37 |          0  (omitted)
_Igrdatloc_38 |          0  (omitted)
_Igrdatloc_39 |          0  (omitted)
_Igrdatloc_40 |          0  (omitted)
_Igrdatloc_41 |          0  (omitted)
_Igrdatloc_42 |          0  (omitted)
_Igrdatloc_43 |          0  (omitted)
_Igrdatloc_44 |          0  (omitted)
_Igrdatloc_45 |          0  (omitted)
_Igrdatloc_46 |          0  (omitted)
_Igrdatloc_47 |          0  (omitted)
_Igrdatloc_48 |          0  (omitted)
_Igrdatloc_49 |          0  (omitted)
_Igrdatloc_50 |          0  (omitted)
_Igrdatloc_51 |          0  (omitted)
_Igrdatloc_52 |          0  (omitted)
_Igrdatloc_53 |          0  (omitted)
   _Igrhour_2 |  -.0045606   .0155155    -0.29   0.771    -.0363958    .0272745
   _Igrhour_3 |    .009445   .0149695     0.63   0.533      -.02127      .04016
   _Igrhour_4 |   .0243235   .0179321     1.36   0.186    -.0124701    .0611171
   _Igrhour_5 |   .0036466   .0177914     0.20   0.839    -.0328584    .0401515
   _Igrhour_6 |  -.0050985   .0201277    -0.25   0.802     -.046397    .0362001
   _Igrarea_2 |  -.0084693   .0114122    -0.74   0.464    -.0318853    .0149466
   _Igrarea_3 |   .0256081   .0182552     1.40   0.172    -.0118484    .0630647
   _Igrarea_4 |  -.0016697    .014512    -0.12   0.909    -.0314458    .0281064
   _Igrarea_5 |   .0262018   .0062653     4.18   0.000     .0133464    .0390571
   _Igrarea_6 |   .0521299   .0086358     6.04   0.000     .0344108    .0698491
   _Igrarea_7 |   .0410535   .0134838     3.04   0.005      .013387      .06872
   _Igrarea_8 |   .0870118    .021096     4.12   0.000     .0437263    .1302972
        _cons |   .0310956   .0132787     2.34   0.027       .00385    .0583413
-------------------------------------------------------------------------------
(option xb assumed; fitted values)
(16,862 missing values generated)
  coeff_b1 =  .00439616
  coeff_b2 = -.01973053
(16,862 missing values generated)
(16,862 missing values generated)
(16,862 missing values generated)
(17,006 real changes made)
(16,989 real changes made)
(17,432 real changes made)

Mean estimation                   Number of obs   =      2,706

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     yhat_Nw |    .047003   .0005769      .0458717    .0481342
     ahat_Nw |   .4303042   .0015095      .4273442    .4332641
       lb_Nw |    .047003   .0005769      .0458717    .0481342
       ub_Nw |   .6166988   .0014536      .6138486     .619549
--------------------------------------------------------------

Mean estimation                   Number of obs   =      2,706

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
      yhat_W |   .0511707   .0005841      .0500254    .0523159
      ahat_W |   .3964938   .0015095      .3935339    .3994538
        lb_W |   .0511707   .0005841      .0500254    .0523159
        ub_W |   .6546768   .0014529       .651828    .6575257
--------------------------------------------------------------

Mean estimation                   Number of obs   =      2,706

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     yhat_Oo |   .0296285   .0005191      .0286106    .0306465
     ahat_Oo |   .3439481   .0015095      .3409881    .3469081
       lb_Oo |   .0296285   .0005191      .0286106    .0306465
       ub_Oo |   .6856804   .0014634      .6828109    .6885499
--------------------------------------------------------------

. 
. 
. *******************************************
. ****  Printing result in a LaTeX file *****
. *******************************************
.                                                   
. matrix results = 100*(results_LaRabida, results_Ecu)

. 
. frmttable using "$Persuasion/results/tableE2", statmat(results) tex replace sdec
> (1) ///
>         ctitles("", P(Y=1|Z=1), e(1), APR (LB), APR (UB), LPR )  ///
>         rtitles("La Rabida: Baseline" \ "La Rabida: Flyer" \ "La Rabida: Opt-Out
> " \ ///
>                         "Ecu: Baseline" \ "Ecu: Flyer" \ "Ecu: Opt-Out")  ///
>         title("Persuasive Effect by Treatment in DLM")
(note: file /Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/results/tabl
> eE2.tex not found)
                      Persuasive Effect by Treatment in DLM
  ------------------------------------------------------------------------------
                         P(Y=1|Z=1)  e(1)  APR (LB)  APR (UB)  LPR             
  ------------------------------------------------------------------------------
   La Rabida: Baseline      5.4      30.4    5.4       74.9    17.7  3.0  34.4 
   La Rabida: Flyer                                                            
   La Rabida: Opt-Out                                                          
   Ecu: Baseline                                                               
   Ecu: Flyer                                                                  
   Ecu: Opt-Out                                                                
  ------------------------------------------------------------------------------


                      Persuasive Effect by Treatment in DLM
                     ---------------------------------------
                                                           
                     ---------------------------------------
                      La Rabida: Baseline   3.0  68.6  8.6 
                      La Rabida: Flyer                     
                      La Rabida: Opt-Out                   
                      Ecu: Baseline                        
                      Ecu: Flyer                           
                      Ecu: Opt-Out                         
                     ---------------------------------------


.         
. 
. 
end of do-file

. 
. *       TABLE H1. Persuasion Rates: NTV Effects Using a Binary Instrument
. do "$Persuasion/scripts/tableH1.do"

. ************
. * SCRIPT:   tableH1.do
. * PURPOSE:  Creates Table H1
. *
. * ACKNOWLEDGMENT
. *       The orginal dataset "NTV_Individual_Data.dta" is from Enikolopov, Petrov
> a, and Zhuravskaya (AER, 2011).
. ************
. 
. use "$Persuasion/data/EnikolopovPetrovaZhuravskaya2011/NTV_Individual_Data.dta",
>  clear

. 
. local basic = "logpop98 wage98_ln"

. local sociodem = "male age educ1 married consump"

. 
. local party_list = "Unity OVR"

. 
. *** create outcome variables based on directional treatment ***
. 
. gen y_vote_Unity = 0

. replace y_vote_Unity = 1 if vote_Unity == 0   
(993 real changes made)

. 
. gen y_vote_OVR = 0

. replace y_vote_OVR = 1 if vote_OVR == 1   
(166 real changes made)

. 
. *** create a binary instrument ***
. 
. svyset [pweight=kishweig]

      pweight: kishweig
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. _pctile tvmaxtveloss5050powerA [pweight=kishweig], p(50)         

. scalar IV_p50 = r(r1)    

. 
.         gen IV_NTV = 0

. replace IV_NTV = 1 if tvmaxtveloss5050powerA > IV_p50
(1,714 real changes made)

. 
. *** predict Z ***
. 
. qui probit  IV_NTV `sociodem' `basic' [pweight=kishweig]  

. predict phat_Z1
(option pr assumed; Pr(IV_NTV))
(4,658 missing values generated)

. 
. *** predict T given Z=1 and Z=0 ***
. 
. qui probit  Watches_NTV_1999 `sociodem' `basic' [pweight=kishweig] if IV_NTV==1 

. predict phat_T_Z1
(option pr assumed; Pr(Watches_NTV_1999))
(4,658 missing values generated)

. 
. qui probit  Watches_NTV_1999 `sociodem' `basic' [pweight=kishweig] if IV_NTV==0 

. predict phat_T_Z0
(option pr assumed; Pr(Watches_NTV_1999))
(4,658 missing values generated)

. 
. *** input for ATE estimation ***
. 
. foreach party in  `party_list'    {
  2. 
. gen newvote_`party' = 0
  3. replace newvote_`party' = 1 if y_vote_`party' == 1  
  4. 
. *** predict Y given Z=1 and Z=0 ***
. 
. qui probit newvote_`party' `sociodem' `basic' [pweight=kishweig] if IV_NTV==1 
  5. predict phat_Y_Z1_`party'
  6. 
. qui probit newvote_`party' `sociodem' `basic' [pweight=kishweig] if IV_NTV==0 
  7. predict phat_Y_Z0_`party'
  8. 
. *** compute ATE and relevant quantities ***
. 
. gen     ate_`party' = (phat_Y_Z1_`party' - phat_Y_Z0_`party')/(1-phat_Y_Z0_`part
> y')
  9. gen      w1_`party' = IV_NTV/phat_Z1
 10. gen      w0_`party' = (1-IV_NTV)/(1-phat_Z1)
 11. gen      t1_`party' = (newvote_`party'-phat_Y_Z1_`party')/(1-phat_Y_Z0_`party
> ') 
 12. gen      t0_`party' = ((newvote_`party'-phat_Y_Z0_`party')*(ate_`party'-1))/(
> 1-phat_Y_Z0_`party') 
 13. gen    infl_`party' = w1_`party'*t1_`party'+w0_`party'*t0_`party'
 14. }
(993 real changes made)
(option pr assumed; Pr(newvote_Unity))
(4,658 missing values generated)
(option pr assumed; Pr(newvote_Unity))
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(166 real changes made)
(option pr assumed; Pr(newvote_OVR))
(4,658 missing values generated)
(option pr assumed; Pr(newvote_OVR))
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)
(4,658 missing values generated)

. 
. *** average out with respect to covariates ***
. 
. svyset [pweight=kishweig]

      pweight: kishweig
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. foreach party in  `party_list'    {
  2. 
. matrix results_`party' = J(3,1,0)
  3. 
.     svy: mean ate_`party' 
  4.     
.         matrix result = e(b)    
  5.     matrix results_`party'[1,1] = result[1,1]
  6.         
.         gen new_infl_`party' = infl_`party' + (ate_`party' - result[1,1])
  7.                  
.     svy: mean new_infl_`party'
  8.         
.         matrix result_se = e(V)
  9.     matrix results_`party'[2,1] = sqrt(result_se[1,1])                       
>     
 10.     matrix results_`party'[3,1] = results_`party'[1,1]-1.645*results_`party'[
> 2,1]                                
 11. }
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      1,300
Number of PSUs   =   1,300        Population size = 1,312.0491
                                  Design df       =      1,299

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   ate_Unity |   .1911595   .0058438      .1796952    .2026237
--------------------------------------------------------------
(4,658 missing values generated)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1          Number of obs   =      1,300
Number of PSUs   =   1,300          Population size = 1,312.0491
                                    Design df       =      1,299

----------------------------------------------------------------
               |             Linearized
               |       Mean   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
new_infl_Unity |  -.0086151   .0830424      -.171527    .1542968
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      1,300
Number of PSUs   =   1,300        Population size = 1,312.0491
                                  Design df       =      1,299

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     ate_OVR |   .0559705   .0020788      .0518923    .0600487
--------------------------------------------------------------
(4,658 missing values generated)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =       1        Number of obs   =      1,300
Number of PSUs   =   1,300        Population size = 1,312.0491
                                  Design df       =      1,299

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
new_infl_OVR |   .0049487   .0241711     -.0424699    .0523673
--------------------------------------------------------------

. 
. *******************************************
. ****  Printing result in a LaTeX file *****
. *******************************************
.                                                   
. matrix results = (results_Unity, results_OVR)

. 
. frmttable using "$Persuasion/results/tableH1", statmat(results) tex replace sdec
> (3) ///
>         title("Table H1") ///
>         ctitles("", Not Voting for Unity, Voting for Unity )  ///
>         rtitles("Point estimate of the lower bound" \ "Standard error of the low
> er bound" \ ///
>         "One-sided 95\% confidence interval" ) 

                                     Table H1
 -------------------------------------------------------------------------------
                                       Not Voting for Unity  Voting for Unity  
 -------------------------------------------------------------------------------
  Point estimate of the lower bound           0.191                0.056       
  Standard error of the lower bound           0.083                0.024       
  One-sided 95\% confidence interval          0.055                0.016       
 -------------------------------------------------------------------------------


. 
end of do-file

. 
. 
. 
. 
. * End log
. di "End date and time: $S_DATE $S_TIME"
End date and time:  7 Nov 2022 12:24:44

. log close
      name:  <unnamed>
       log:  /Users/sokbaelee/Dropbox/Persuasion/JPE/Replication Files/scripts/log
> s/2022.11.07-12.24.42.log.txt
  log type:  text
 closed on:   7 Nov 2022, 12:24:44
----------------------------------------------------------------------------------
